[
  {
    "title": "New POS Malware “ShadowPOS” Advertised in DarkWeb Forum",
    "date": "August 16, 2024",
    "url": "https://dailydarkweb.net/new-pos-malware-shadowpos-advertised-in-darkweb-forum/",
    "content": "<div class=\"content-inner \">\n\t\t\t\t\t\t\t\t<p>A threat actor recently introduced a new Point of Sale (POS) malware called <strong>“ShadowPOS”</strong> on a well-known cybercrime forum. Still under development, the malware is marketed as an advanced tool designed to infiltrate POS systems, steal unencrypted credit card data, and send it to a command and control (C2) server.</p>\n<h4>Stealth and Persistence Features</h4>\n<p>The creator of ShadowPOS describes it as both highly persistent and stealthy. It scans memory at regular intervals and uploads stolen data to its C2 server. By running as a single-threaded process, the malware minimizes system resource usage, making it harder to detect.</p>\n<h4>Advanced Scanning Capabilities</h4>\n<p>ShadowPOS uses a complex algorithm that efficiently locates and verifies card data. It relies on Google’s RE2 regular expressions engine to perform high-speed memory scanning across all processes on targeted Windows-based POS systems. Unlike other POS malware, ShadowPOS scans all running processes on a terminal, significantly increasing its chances of success.</p>\n<h4>Command &amp; Control Panel</h4>\n<p>The developer is also working on a Command &amp; Control panel, which will allow users to manage and query stolen card data. This panel aims to streamline inventory management for those looking to sell or use the compromised information.</p>\n<h4>Exclusive Pre-Sale Offer</h4>\n<p>The threat actor is offering ShadowPOS for pre-sale with a promise of exclusivity. If purchased, the malware will not be sold as a service to others. The seller also offers to customize the malware according to the buyer’s needs.</p>\n<h4>Compliance with Forum Rules</h4>\n<p>The seller has pre-approved the post with the forum’s staff to ensure it complies with the site’s rules, which prohibit the sale of credit card information and ransomware-related tools. The seller emphasizes that the malware is not intended for ransomware attacks and does not come with any stolen card data.</p>\n<p>&nbsp;</p>\n<p><em><strong>The introduction of ShadowPOS highlights the ongoing evolution of cyber threats targeting businesses. Organizations must strengthen their security measures, including the encryption of card data and regular monitoring for unusual activity, to mitigate the risks posed by this and similar malware.</strong></em></p>\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>"
  },
  {
    "title": "New CRYPTOKAT Ransomware Released",
    "date": "August 2, 2024",
    "url": "https://dailydarkweb.net/new-cryptokat-ransomware-released/",
    "content": "<div class=\"content-inner \">\n\t\t\t\t\t\t\t\t<p>The cybercrime market has a new addition with the release of RYPTOKAT ransomware. This new ransomware tool promises to deliver advanced encryption techniques, fast operational capabilities, and a user-friendly interface, making it a noteworthy option for cybercriminals looking to maximize their efficiency and impact. RYPTOKAT aims to streamline the process of creating and deploying ransomware, ensuring that even those with minimal technical expertise can effectively use it.</p>\n<p><strong>Features and Functionality</strong></p>\n<p>RYPTOKAT includes a range of features designed to enhance the effectiveness of ransomware campaigns:</p>\n<ul>\n<li><strong>Advanced Encryption</strong>: Uses AES encryption for secure file locking.</li>\n<li><strong>Fast Encryption</strong>: Operates at maximum disk speed for quick encryption.</li>\n<li><strong>Unique Executables</strong>: Each executable file is unique to reduce detection.</li>\n<li><strong>No Windows Pop-Ups</strong>: Ensures there are no alert pop-ups.</li>\n<li><strong>Windows 11 FUD</strong>: Fully undetectable on Windows 11 systems.</li>\n<li><strong>Decryption Key Security</strong>: Decryption key is not stored on the victim’s machine.</li>\n</ul>\n<p>RYPTOKAT is available for a one-time purchase price of $299, discounted from the original $599. Payments are accepted in Litecoin (LTC) or Monero (XMR).</p>\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>"
  },
  {
    "title": "Threat Actor Claims Sale of Dell Database Containing 49 Million Customer Records",
    "date": "April 29, 2024",
    "url": "https://dailydarkweb.net/threat-actor-claims-sale-of-dell-database-containing-49-million-customer-records/",
    "content": "<div class=\"content-inner \">\n\t\t\t\t\t\t\t\t<p>Reports emerge of a significant security breach as a threat actor alleges to be selling a database purportedly containing 49 million customer records from Dell, a leading technology company. The alleged data encompasses information on systems purchased from Dell between 2017 and 2024, comprising a comprehensive repository of customer details.<br>\n<img data-dominant-color=\"e0e3e6\" data-has-transparency=\"true\" style=\"--dominant-color: #e0e3e6;\" decoding=\"async\" class=\"has-transparency alignnone  wp-image-2099\" src=\"https://dailydarkweb.net/wp-content/uploads/2024/04/sample-1-1-300x113.png\" alt=\"\" width=\"977\" height=\"368\" srcset=\"https://dailydarkweb.net/wp-content/uploads/2024/04/sample-1-1-300x113.png 300w, https://dailydarkweb.net/wp-content/uploads/2024/04/sample-1-1-1024x386.png 1024w, https://dailydarkweb.net/wp-content/uploads/2024/04/sample-1-1-768x290.png 768w, https://dailydarkweb.net/wp-content/uploads/2024/04/sample-1-1-600x226.png 600w, https://dailydarkweb.net/wp-content/uploads/2024/04/sample-1-1-750x283.png 750w, https://dailydarkweb.net/wp-content/uploads/2024/04/sample-1-1-1140x430.png 1140w, https://dailydarkweb.net/wp-content/uploads/2024/04/sample-1-1.png 1174w\" sizes=\"(max-width: 977px) 100vw, 977px\"></p>\n<p>The data, claimed to be up-to-date information registered at Dell servers, includes vital personal and company information such as full names, addresses, cities, provinces, postal codes, countries, unique 7-digit service tags of systems, system shipment dates (warranty start), warranty plans, serial numbers (for monitors), Dell customer numbers, and Dell order numbers. Notably, the threat actor asserts to be the sole possessor of this data, underscoring the severity of the breach. Among the staggering number of records, approximately 7 million rows pertain to individual/personal purchases, while 11 million belong to consumer segment companies. The remaining data pertains to enterprise, partner, schools, or unidentified entities. Furthermore, the threat actor highlights the top five countries with the most systems represented in the database, including the United States, China, India, Australia, and Canada. This revelation raises significant concerns regarding the security and privacy of Dell customers’ information, prompting urgent action to mitigate potential risks and prevent further unauthorized access.</p>\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>"
  },
  {
    "title": "Threat Actor Claims to Have Leaked Database Containing Personal Information of 5 Million Salvadoran Citizens",
    "date": "April 6, 2024",
    "url": "https://dailydarkweb.net/threat-actor-claims-to-have-leaked-database-containing-personal-information-of-5-million-salvadoran-citizens/",
    "content": "<div class=\"content-inner \">\n\t\t\t\t\t\t\t\t<p>A threat actor has purportedly leaked a database containing the personal information and photos of 5 million Salvadoran citizens in El Salvador. According to the threat actor, the leaked data consists of 5,129,518 high-definition photos without watermarks, each labeled with the individual’s “DUI” identification number, totaling 144 GB in size. Additionally, the leaked database includes comprehensive citizen information, including identification document (DUI) numbers, names, last names, dates of birth, telephone numbers, email addresses, and residential addresses. This release follows a previous attempt to sell the data, with the threat actor now making it available for free.</p>\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>"
  },
  {
    "title": "Threat Actor Claims Sale of State Grid Corporation of China (SGCC) Data, World’s Largest Utility Company",
    "date": "June 8, 2024",
    "url": "https://dailydarkweb.net/threat-actor-claims-sale-of-state-grid-corporation-of-china-sgcc-data-worlds-largest-utility-company/",
    "content": "<div class=\"content-inner \">\n\t\t\t\t\t\t\t\t<p>A threat actor has claimed to have recently gained access to a third-party system, thereby acquiring sensitive information belonging to the State Grid Corporation of China (SGCC). SGCC is a state-owned electric utility corporation and the largest utility company in the world.</p>\n<p>The alleged data breach includes several categories of information, such as corporate user accounts, user information, department details, and roles. The compromised data reportedly contains information on thousands of employees, including their eIDs, usernames, phone numbers, emails, employee numbers, and passwords.</p>\n<p><a href=\"https://dailydarkweb.net/wp-content/uploads/2024/06/sample1.png\"><img data-dominant-color=\"303030\" data-has-transparency=\"true\" style=\"--dominant-color: #303030;\" decoding=\"async\" class=\"has-transparency wp-image-2964  aligncenter\" src=\"https://dailydarkweb.net/wp-content/uploads/2024/06/sample1-300x116.png\" alt=\"\" width=\"913\" height=\"353\" srcset=\"https://dailydarkweb.net/wp-content/uploads/2024/06/sample1-300x116.png 300w, https://dailydarkweb.net/wp-content/uploads/2024/06/sample1-1024x395.png 1024w, https://dailydarkweb.net/wp-content/uploads/2024/06/sample1-768x296.png 768w, https://dailydarkweb.net/wp-content/uploads/2024/06/sample1-750x289.png 750w, https://dailydarkweb.net/wp-content/uploads/2024/06/sample1-1140x440.png 1140w, https://dailydarkweb.net/wp-content/uploads/2024/06/sample1.png 1366w\" sizes=\"(max-width: 913px) 100vw, 913px\"></a></p>\n<p>The threat actor is offering this data for sale at $1000, with escrow services involved to facilitate the transaction. The data is available in SQL and XLSX formats.</p>\n<p>For inquiries, the threat actor has provided contact details on Telegram.</p>\n<p><a href=\"https://dailydarkweb.net/wp-content/uploads/2024/06/sample2.png\"><img data-dominant-color=\"2b2b2b\" data-has-transparency=\"true\" style=\"--dominant-color: #2b2b2b;\" decoding=\"async\" class=\"has-transparency wp-image-2965  aligncenter\" src=\"https://dailydarkweb.net/wp-content/uploads/2024/06/sample2-300x92.png\" alt=\"\" width=\"910\" height=\"279\" srcset=\"https://dailydarkweb.net/wp-content/uploads/2024/06/sample2-300x92.png 300w, https://dailydarkweb.net/wp-content/uploads/2024/06/sample2-1024x314.png 1024w, https://dailydarkweb.net/wp-content/uploads/2024/06/sample2-768x235.png 768w, https://dailydarkweb.net/wp-content/uploads/2024/06/sample2-750x230.png 750w, https://dailydarkweb.net/wp-content/uploads/2024/06/sample2-1140x349.png 1140w, https://dailydarkweb.net/wp-content/uploads/2024/06/sample2.png 1371w\" sizes=\"(max-width: 910px) 100vw, 910px\"></a></p>\n<p>The breach of such sensitive information from a major utility company like SGCC highlights the critical need for robust cybersecurity measures. As this situation develops, it will be important to monitor the potential implications for both the corporation and its employees.</p>\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>"
  },
  {
    "title": "New ATM Malware Threatens European Banking Security",
    "date": "May 25, 2024",
    "url": "https://dailydarkweb.net/new-atm-malware-threatens-european-banking-security/",
    "content": "<div class=\"content-inner \">\n\t\t\t\t\t\t\t\t<p>A highly alarming new type of ATM malware has emerged in Europe, boasting an unprecedented 99% success rate. Dubbed <strong>“EU ATM Malware”</strong>. This malicious software has the potential to compromise almost any ATM in Europe and approximately <strong>60% of ATMs worldwide</strong>, posing a significant threat to global banking security. The malware is reportedly capable of targeting ATMs manufactured by leading companies such as <em>Diebold Nixdorf, Hyosung, Oki, Bank of America, NCR, GRG, and Hitachi</em>, among others.</p>\n<p>&nbsp;</p>\n<p>The developers of this malware claim that it can generate up to <strong>$30,000 per ATM</strong>, making it a lucrative tool for cybercriminals. The malware is fully automated, simplifying its deployment and operation. However, it also includes a manual operation mode for those who prefer a hands-on approach.</p>\n<p>&nbsp;</p>\n<p><strong>The malware is being sold with flexible payment options, including:</strong></p>\n<ul>\n<li>A monthly subscription.</li>\n<li>A test payload option valid for three days.</li>\n<li>An initial fee plus a share of the profits from successful jackpotting operations<strong>.</strong></li>\n</ul>\n<p>The European banking sector, known for its stringent security measures, now faces a formidable challenge in safeguarding its ATM infrastructure against this advanced and pervasive threat.</p>\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>"
  },
  {
    "title": "CyberNiggers Group Allegedly Breaches HSBC and Barclays Banks, Compromising Extensive Databases and Source Code",
    "date": "April 2, 2024",
    "url": "https://dailydarkweb.net/cyberniggers-group-allegedly-breaches-hsbc-and-barclays-banks-compromising-extensive-databases-and-source-code/",
    "content": "<div class=\"content-inner \">\n\t\t\t\t\t\t\t\t<p>The CyberNiggers group has asserted its infiltration into the security systems of HSBC and Barclays banks, allegedly orchestrated by members Sanggiero and IntelBroker. The breach has led to the compromise of extensive databases. Among these datasets are notary_request_2024.csv, boasting 512K lines, ledger_summary_2024.csv with 241K lines, _transaction__2024.csv containing a staggering 1 million lines, and notification_2024.csv with 501K lines. Each of these files delineates crucial aspects of banking operations, offering insight into transaction records, account details, and user notifications.</p>\n<p>Beyond these primary databases, the cyber assailants claim to have accessed a trove of additional files, including security certificates, PIX keys, JKS files, security signing keys, and compiled .Jar files. Furthermore, they boast of acquiring source code extracted from the GitLab repository, exacerbating the severity of the breach. Additionally, the hackers assert control over miscellaneous unsorted documents, suggesting a comprehensive infiltration into the banks’ digital infrastructure. This brazen act underscores the growing sophistication and audacity of cyber threats facing the global financial sector.</p>\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>"
  },
  {
    "title": "“DIANA” Malware Command and Control Framework for Sale",
    "date": "August 8, 2024",
    "url": "https://dailydarkweb.net/diana-malware-command-and-control-framework-for-sale/",
    "content": "<div class=\"content-inner \">\n\t\t\t\t\t\t\t\t<p>A recent dark web announcement has revealed the sale of a sophisticated <strong>Command and Control (C2)</strong> framework named <strong>“DIANA,”</strong> designed explicitly for advanced threat actors. The seller is offering the complete package, which includes full source code and continuous updates, for <strong>$3,700</strong>. The seller claims that DIANA is a powerful tool capable of bypassing Endpoint Detection and Response (EDR) solutions, making it an attractive option for cybercriminals looking to conduct stealthy operation</p>\n<h5><strong>Key Features of DIANA:</strong></h5>\n<ul>\n<li><strong>Web-Based C2 Panel:</strong> DIANA’s interface is fully web-based and responsive, allowing operators to control it from various devices, including mobile phones. This flexibility ensures ease of use in different environments.</li>\n<li><strong>Advanced Malware Capabilities:</strong> Attackers can install implants on target devices and control them remotely. DIANA uses standard technologies like HTTP for compatibility, avoiding the need for proprietary protocols. As a result, the framework remains versatile across different scenarios.</li>\n<li><strong>EDR and IDS Bypass:</strong> DIANA can evade detection by EDR and Intrusion Detection Systems (IDS), using legitimate services as a proxy. This approach makes its traffic appear normal, even to network-level protections, significantly increasing its stealth capabilities.</li>\n<li><strong>Customization and Flexibility:</strong> Users can customize DIANA’s pre-built payloads with various options to bypass security measures. Additionally, the framework supports collaboration, allowing multiple users to operate on the same target simultaneously. This feature is particularly beneficial for coordinated attacks.</li>\n<li><strong>Stealth Features:</strong> DIANA can be deployed behind Cloudflare, which increases its resilience against takedown attempts. Moreover, it includes “decoy pages” that further conceal the C2’s existence, adding another layer of security for the operator.</li>\n<li><strong>Easy Deployment:</strong> DIANA is user-friendly, simplifying the setup process. The seller provides a script that automates the installation of web servers, databases, and the framework itself. Consequently, even users with limited technical skills can deploy it effectively.</li>\n<li><strong>Cross-Platform and IoT Compatibility:</strong> DIANA is versatile, working on various devices, including IoT, by avoiding the storage of any state on the target device. This feature ensures that DIANA remains operational across different platforms.</li>\n</ul>\n<p>The framework is written in multiple programming languages, including <em>PHP, HTML, CSS, JavaScript, Go, Python, MySQL, and Bash</em>, emphasizing its adaptability.</p>\n<p><em><strong>The sale of DIANA underscores the growing sophistication of tools available to cybercriminals. The ability to bypass modern security solutions like EDR and IDS could lead to significant breaches. Therefore, organizations should strengthen their security measures and remain vigilant against such advanced threats</strong></em></p>\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>"
  },
  {
    "title": "Spain Remains a Target of Alleged Cyber Attacks",
    "date": "July 26, 2024",
    "url": "https://dailydarkweb.net/spain-remains-a-target-of-alleged-cyber-attacks/",
    "content": "<div class=\"content-inner \">\n\t\t\t\t\t\t\t\t<p>Several threat actors were publishing messages on their Telegram channels, indicating that they were targeting Spain for several days. Recently, they shared new messages, allegedly attacked more Spanish organizations.</p>\n<p>Spanish organizations were being targeted due to Spain’s NATO membership and the recent arrest of cybercriminals linked to NoName057(16).</p>\n<p>The Holy League Telegram channel talked about targeting Spain. According to the message, they were able to break into the servers of one of the Spanish providers.</p>\n<p><img data-dominant-color=\"e7e7e1\" data-has-transparency=\"true\" style=\"--dominant-color: #e7e7e1;\" decoding=\"async\" class=\"has-transparency alignnone size-full wp-image-3902\" src=\"https://dailydarkweb.net/wp-content/uploads/2024/07/spain3rd_1_f.png\" alt=\"\" width=\"414\" height=\"692\" srcset=\"https://dailydarkweb.net/wp-content/uploads/2024/07/spain3rd_1_f.png 414w, https://dailydarkweb.net/wp-content/uploads/2024/07/spain3rd_1_f-179x300.png 179w\" sizes=\"(max-width: 414px) 100vw, 414px\"></p>\n<p>The latest alleged victims of NoName057(16) were as follows according to the threat actor’s telegram channel.</p>\n<ul>\n<li>Bergé Logistics Logistics and Transportation</li>\n<li>Authorization on Ferrocarrils de la Generalitat de Catalunya railway company portal</li>\n<li>Cartagena port</li>\n<li>Palma de Mallorca Port</li>\n<li>Port A Coruña</li>\n<li>Port of Huelva</li>\n</ul>\n<p>Народная CyberАрмия on the other hand shared a Telegram message, allegedly targeted The Port of Malaga.</p>\n<p><img data-dominant-color=\"e9eee7\" data-has-transparency=\"true\" style=\"--dominant-color: #e9eee7;\" decoding=\"async\" class=\"has-transparency alignnone size-full wp-image-3903\" src=\"https://dailydarkweb.net/wp-content/uploads/2024/07/spain3rd_3_f.png\" alt=\"\" width=\"409\" height=\"661\" srcset=\"https://dailydarkweb.net/wp-content/uploads/2024/07/spain3rd_3_f.png 409w, https://dailydarkweb.net/wp-content/uploads/2024/07/spain3rd_3_f-186x300.png 186w\" sizes=\"(max-width: 409px) 100vw, 409px\"></p>\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>"
  },
  {
    "title": "5 Million Romanians’ Data is Allegedly Leaked",
    "date": "July 12, 2024",
    "url": "https://dailydarkweb.net/5-million-romanians-data-is-allegedly-leaked/",
    "content": "<div class=\"content-inner \">\n\t\t\t\t\t\t\t\t<p>According to a threat actor on a dark web forum, data belonging to more than 5 million people is leaked and the numbers are increasing every day. Threat actor states that data can be sold in smaller batches as well.</p>\n<p>The post indicates that the alleged leak consists of information such as full name, SSN, physical address, email address, phone number, workplace history, medical information, financial information and more.</p>\n<p>The threat actor accepts payment only via XMR and escrow is mandatory. Additionally, buyers must provide proof of funds if they want to buy the alleged data. The post also includes a Telegram link for those willing to contact.</p>\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>"
  },
  {
    "title": "Threat Actor Claims to Breached Tribunal Superior de Justicia CDMX Database",
    "date": "August 7, 2024",
    "url": "https://dailydarkweb.net/threat-actor-claims-to-breached-tribunal-superior-de-justicia-cdmx-database/",
    "content": "<div class=\"content-inner \">\n\t\t\t\t\t\t\t\t<p>A threat actor has claimed responsibility for a significant data breach involving the Tribunal Superior de Justicia of Mexico City. The compromised data reportedly includes access to more than 300,000 accounts with MD5 hashed passwords, which are easy to crack. The leaked data, spanning from 2017 to 2024, includes sensitive information such as claims, appointments, actuaries, pensions, vouchers, and more.</p>\n<p><strong>Key Details:</strong></p>\n<ul>\n<li><strong>Affected Sites:</strong>\n<ul>\n<li>citasopc.poderjudicialcdmx.gob.mx</li>\n<li>citas.poderjudicialcdmx.gob.mx/juzgados/</li>\n</ul>\n</li>\n</ul>\n<p><a href=\"https://dailydarkweb.net/wp-content/uploads/2024/08/incident-000418.png\"><img data-dominant-color=\"44454c\" data-has-transparency=\"true\" style=\"--dominant-color: #44454c;\" decoding=\"async\" class=\"has-transparency  wp-image-4153 aligncenter\" src=\"https://dailydarkweb.net/wp-content/uploads/2024/08/incident-000418.png\" alt=\"\" width=\"726\" height=\"364\" srcset=\"https://dailydarkweb.net/wp-content/uploads/2024/08/incident-000418.png 1774w, https://dailydarkweb.net/wp-content/uploads/2024/08/incident-000418-300x151.png 300w, https://dailydarkweb.net/wp-content/uploads/2024/08/incident-000418-1024x514.png 1024w, https://dailydarkweb.net/wp-content/uploads/2024/08/incident-000418-768x385.png 768w, https://dailydarkweb.net/wp-content/uploads/2024/08/incident-000418-1536x771.png 1536w, https://dailydarkweb.net/wp-content/uploads/2024/08/incident-000418-360x180.png 360w, https://dailydarkweb.net/wp-content/uploads/2024/08/incident-000418-750x376.png 750w, https://dailydarkweb.net/wp-content/uploads/2024/08/incident-000418-1140x572.png 1140w\" sizes=\"(max-width: 726px) 100vw, 726px\"></a></p>\n<p><strong>Content Claimed to be Leaked:</strong></p>\n<ul>\n<li>Database of the superior court of justice of Mexico City</li>\n<li>Source code</li>\n<li>Detailed information on various legal proceedings and user data</li>\n</ul>\n<p>The veracity of the data breach claim has not been independently verified, and the information is presented based on the claims made by the threat actor involved.</p>\n<p>&nbsp;</p>\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>"
  },
  {
    "title": "New DDoS Panel “Cliver” Announced by Threat Actor",
    "date": "July 23, 2024",
    "url": "https://dailydarkweb.net/new-ddos-panel-cliver-announced-by-threat-actor/",
    "content": "<div class=\"content-inner \">\n\t\t\t\t\t\t\t\t<p>A new Distributed Denial-of-Service (DDoS) tool called Cliver has been announced by a threat actor, promising powerful capabilities and a variety of methods for disrupting web services. Cliver boasts several attack methods, including strong HTTP/2 header attacks (http2), TLS floods with bypass (tls), high-rate HTTP/2 flooders with bypass (http-rose), Cloudflare bypass HTTP DDoS (http-ddos), low-rate HTTP/2 flooders for protected sites (http-zeus), high-request HTTP/1.1 floods for HTTP sites (http-blue), and high-request flooders with bypass and headers (http-star). Additionally, it features browser emulation for bypassing CAPTCHA (browser) and browser emulation with proxies and headers (browserv2).</p>\n<p><a href=\"https://dailydarkweb.net/wp-content/uploads/2024/07/panel.png\"><img data-dominant-color=\"120707\" data-has-transparency=\"true\" style=\"--dominant-color: #120707;\" decoding=\"async\" class=\"has-transparency aligncenter wp-image-3783 \" src=\"https://dailydarkweb.net/wp-content/uploads/2024/07/panel-300x199.png\" alt=\"\" width=\"950\" height=\"630\" srcset=\"https://dailydarkweb.net/wp-content/uploads/2024/07/panel-300x199.png 300w, https://dailydarkweb.net/wp-content/uploads/2024/07/panel-1024x679.png 1024w, https://dailydarkweb.net/wp-content/uploads/2024/07/panel-768x509.png 768w, https://dailydarkweb.net/wp-content/uploads/2024/07/panel-750x497.png 750w, https://dailydarkweb.net/wp-content/uploads/2024/07/panel.png 1047w\" sizes=\"(max-width: 950px) 100vw, 950px\"></a></p>\n<p>The threat actor provided further details in a frequently asked questions section. Cliver is described as a powerful Layer 7 (L7) DDoS panel with numerous private methods, capable of being set up on both Linux and Windows operating systems. It is capable of sending up to 500,000 requests per second using only one device. Cliver also automatically scrapes and uses HTTP proxies.</p>\n<p>The tool is being sold for $20, with payment accepted in various cryptocurrencies, excluding Bitcoin (BTC) and Tether (USDT). This announcement highlights the continued evolution of DDoS tools, making it easier for malicious actors to launch sophisticated attacks. The affordability and advanced features of Cliver underscore the importance of robust cybersecurity measures for all web services.</p>\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>"
  },
  {
    "title": "A Threat Actor Claims to Have RCE Exploit in Albatross Protocol, Selling for $10k",
    "date": "July 25, 2024",
    "url": "https://dailydarkweb.net/a-threat-actor-claims-to-have-rce-exploit-in-albatross-protocol-selling-for-10k/",
    "content": "<div class=\"content-inner \">\n\t\t\t\t\t\t\t\t<p>A hacker has claims to selling of a <strong>remote code execution (RCE</strong>) exploit for the Albatross Protocol. According to the hacker, the exploit leverages a buffer overflow vulnerability, though it faces limitations with certain security measures.</p>\n<p><strong>Exploit Details:</strong></p>\n<ul>\n<li><em><strong>Type:</strong> Remote Code Execution (RCE)</em></li>\n<li><em><strong>Target:</strong> Albatross Protocol</em></li>\n<li><em><strong>Vulnerability:</strong> Buffer Overflow</em></li>\n<li><em><strong>Limitations:</strong></em>\n<ul>\n<li><em>Does not work with Address Space Layout Randomization (ASLR) enabled.</em></li>\n<li><em>Faces issues bypassing FULL RELRO (Read-Only Relocations) as it requires writing in the Global Offset Table (GOT).</em></li>\n<li><em>Successfully bypasses NX (No eXecute) or Data Execution Prevention (DEP).</em></li>\n</ul>\n</li>\n<li><em><strong>Price:</strong> $10,000</em></li>\n<li><em><strong>Availability:</strong> Works on all versions for the past 7 months</em></li>\n</ul>\n<p><strong>Seller’s Note:</strong> The hacker claims that despite the limitations, the exploit is effective across multiple versions of the Albatross Protocol over the last seven months. Potential buyers are directed to contact the seller for more information through the provided thread.</p>\n<h3><strong>Exploit 2: Nimiq’s Blockchain Protocol</strong></h3>\n<p><strong>Details:</strong></p>\n<ul>\n<li><em><strong>Type:</strong> Buffer Overflow (BOF)</em></li>\n<li><em><strong>Target:</strong> Nimiq’s Blockchain Protocol</em></li>\n<li><em><strong>Tested on:</strong> Linux</em></li>\n<li><em><strong>Version:</strong> Latest</em></li>\n<li><em><strong>Price:</strong> $5,000</em></li>\n<li><em><strong>Capabilities:</strong> Can be exploited to achieve RCE, though not weaponized; the seller offers the vulnerable point.</em></li>\n<li><em><strong>Payment Method:</strong> Bitcoin (BTC) and Escrow only</em></li>\n</ul>\n<p>The hacker previously advertised a buffer overflow exploit in Nimiq’s blockchain protocol. This vulnerability, tested on the latest Linux version, can potentially lead to remote code execution.</p>\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>"
  },
  {
    "title": "Threat Actor Offers 66,000 Emails from Trezor.io Cryptocurrency Wallet Brand for 1.5 BTC",
    "date": "March 12, 2024",
    "url": "https://dailydarkweb.net/threat-actor-offers-66000-emails-from-trezor-io-cryptocurrency-wallet-brand-for-1-5-btc/",
    "content": "<div class=\"content-inner \">\n\t\t\t\t\t\t\t\t<p>In a concerning development, a threat actor has purportedly obtained and is now offering for sale the database of Trezor, a reputable brand known for its hardware cryptocurrency wallets accessible through Trezor.io. These wallets are designed to provide users with a secure and convenient way to store and manage their digital assets, such as Bitcoin and other cryptocurrencies. Trezor wallets are widely regarded for their emphasis on security features, including offline storage and strong encryption, which help protect users’ funds from unauthorized access and hacking attempts.</p>\n<p>According to the threat actor’s claims, the leaked database contains an estimated 66,000 email addresses. This revelation raises significant security concerns among users of Trezor’s services, given the sensitive nature of cryptocurrency-related information. The threat actor is reportedly demanding a price of 1.5 BTC for access to the compromised data. This incident underscores the persistent threat posed by cybercriminals targeting cryptocurrency platforms and highlights the importance of robust security measures to safeguard users’ sensitive financial information.</p>\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>"
  },
  {
    "title": "Play Ransomware and LockBit Allegedly Created an Alliance",
    "date": "July 25, 2024",
    "url": "https://dailydarkweb.net/play-ransomware-and-lockbit-allegedly-created-an-alliance/",
    "content": "<div class=\"content-inner \">\n\t\t\t\t\t\t\t\t<p>There are claims circulating that Play Ransomware and LockBit have formed a partnership. Several messages were sent on the ‘PLAY NEWS (Ransomware)’ Telegram channel about the topic.</p>\n<p>According to the alleged conversations, the agreement between the parties involves a $35,000 payment by Play Ransomware for tools from LockBit. Additionally, LockBit will offer its knowledge and methods to improve Play Ransomware’s operational effectiveness and reach.</p>\n<p><img data-dominant-color=\"27313e\" data-has-transparency=\"true\" style=\"--dominant-color: #27313e;\" decoding=\"async\" class=\"has-transparency alignnone size-full wp-image-3888\" src=\"https://dailydarkweb.net/wp-content/uploads/2024/07/lockbit_2_f.png\" alt=\"\" width=\"558\" height=\"849\" srcset=\"https://dailydarkweb.net/wp-content/uploads/2024/07/lockbit_2_f.png 558w, https://dailydarkweb.net/wp-content/uploads/2024/07/lockbit_2_f-197x300.png 197w\" sizes=\"(max-width: 558px) 100vw, 558px\"> <img data-dominant-color=\"dad3c2\" data-has-transparency=\"true\" style=\"--dominant-color: #dad3c2;\" decoding=\"async\" class=\"has-transparency alignnone size-full wp-image-3889\" src=\"https://dailydarkweb.net/wp-content/uploads/2024/07/lockbit_3_f.png\" alt=\"\" width=\"1200\" height=\"481\" srcset=\"https://dailydarkweb.net/wp-content/uploads/2024/07/lockbit_3_f.png 1200w, https://dailydarkweb.net/wp-content/uploads/2024/07/lockbit_3_f-300x120.png 300w, https://dailydarkweb.net/wp-content/uploads/2024/07/lockbit_3_f-1024x410.png 1024w, https://dailydarkweb.net/wp-content/uploads/2024/07/lockbit_3_f-768x308.png 768w, https://dailydarkweb.net/wp-content/uploads/2024/07/lockbit_3_f-750x301.png 750w, https://dailydarkweb.net/wp-content/uploads/2024/07/lockbit_3_f-1140x457.png 1140w\" sizes=\"(max-width: 1200px) 100vw, 1200px\"></p>\n<p>According to the messages, we see a positive and cooperative approach from both parties. Play Ransomware is pleased with the collaboration and has highlighted the possible advantages and improvements that can be achieved.</p>\n<p>As of now, there have been no announcements or updates from the LockBit ransomware group regarding the alleged cooperation with the Play Ransomware group.</p>\n<p><img data-dominant-color=\"2c4766\" data-has-transparency=\"true\" style=\"--dominant-color: #2c4766;\" loading=\"lazy\" decoding=\"async\" class=\"has-transparency alignnone size-full wp-image-3890\" src=\"https://dailydarkweb.net/wp-content/uploads/2024/07/lockbit_4_f.png\" alt=\"\" width=\"585\" height=\"1132\" srcset=\"https://dailydarkweb.net/wp-content/uploads/2024/07/lockbit_4_f.png 585w, https://dailydarkweb.net/wp-content/uploads/2024/07/lockbit_4_f-155x300.png 155w, https://dailydarkweb.net/wp-content/uploads/2024/07/lockbit_4_f-529x1024.png 529w\" sizes=\"(max-width: 585px) 100vw, 585px\"></p>\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>"
  },
  {
    "title": "Stormous Announced the Release of Ransomware Program Version 3",
    "date": "July 24, 2024",
    "url": "https://dailydarkweb.net/stormous-announced-the-release-of-ransomware-program-version-3/",
    "content": "<div class=\"content-inner \">\n\t\t\t\t\t\t\t\t<p>Stormous has unveiled the third version of their ransomware program, introducing a host of new features and enhancements aimed at providing a superior user experience and increased efficiency in managing victims.</p>\n<p><strong>Enhanced Features and Capabilities</strong></p>\n<p>The latest version of the ransomware program, developed using <strong>GOLang</strong>, claims to offer fully effective and speedy encryption, ensuring all files are quickly and thoroughly encrypted. The program is designed to be lightweight, with a unique executable file for each subscriber, and they claimed compatible with both x86 and x64 Windows platforms.</p>\n<p><a href=\"https://dailydarkweb.net/wp-content/uploads/2024/07/incident-000287.png\"><img data-dominant-color=\"67160b\" data-has-transparency=\"true\" style=\"--dominant-color: #67160b;\" decoding=\"async\" class=\"has-transparency  wp-image-3812 aligncenter\" src=\"https://dailydarkweb.net/wp-content/uploads/2024/07/incident-000287.png\" alt=\"\" width=\"715\" height=\"363\" srcset=\"https://dailydarkweb.net/wp-content/uploads/2024/07/incident-000287.png 1360w, https://dailydarkweb.net/wp-content/uploads/2024/07/incident-000287-300x152.png 300w, https://dailydarkweb.net/wp-content/uploads/2024/07/incident-000287-1024x520.png 1024w, https://dailydarkweb.net/wp-content/uploads/2024/07/incident-000287-768x390.png 768w, https://dailydarkweb.net/wp-content/uploads/2024/07/incident-000287-750x381.png 750w, https://dailydarkweb.net/wp-content/uploads/2024/07/incident-000287-1140x578.png 1140w\" sizes=\"(max-width: 715px) 100vw, 715px\"></a></p>\n<p><strong>Key Features:</strong></p>\n<ul>\n<li><em><strong>Full and Fast Encryption</strong>: Encrypt all files effectively and swiftly.</em></li>\n<li><em><strong>Task Manager Disabling</strong>: Prevent victims from stopping the malware by disabling the Task Manager.</em></li>\n<li><em><strong>UAC Bypass</strong>: Enable bypassing of User Account Control (UAC).</em></li>\n<li><em><strong>Custom Ransom Note</strong>: Design and customize the ransom note to suit individual needs.</em></li>\n</ul>\n<p><strong>C2 Dashboard (RaaS) Features:</strong></p>\n<ul>\n<li><em><strong>IP Tracking</strong>: Monitor the victim’s IP address.</em></li>\n<li><em><strong>Infected Device Tracking</strong>: Track the status of the infected device.</em></li>\n<li><em><strong>Encryption File Tracking</strong>: Log and track encrypted files in real-time.</em></li>\n<li><em><strong>Device Control and Data Sending</strong>: Send data uploads to a private server.</em></li>\n<li><em><strong>Link to Private Blog</strong>: Direct victims to a blog via the C2 dashboard that provides updated information on victims, including companies and high-profile targets.</em></li>\n</ul>\n<p><a href=\"https://dailydarkweb.net/wp-content/uploads/2024/07/incident-000279.png\"><img data-dominant-color=\"6c1311\" data-has-transparency=\"true\" style=\"--dominant-color: #6c1311;\" decoding=\"async\" class=\"has-transparency  wp-image-3807 aligncenter\" src=\"https://dailydarkweb.net/wp-content/uploads/2024/07/incident-000279.png\" alt=\"\" width=\"679\" height=\"403\" srcset=\"https://dailydarkweb.net/wp-content/uploads/2024/07/incident-000279.png 1424w, https://dailydarkweb.net/wp-content/uploads/2024/07/incident-000279-300x178.png 300w, https://dailydarkweb.net/wp-content/uploads/2024/07/incident-000279-1024x607.png 1024w, https://dailydarkweb.net/wp-content/uploads/2024/07/incident-000279-768x455.png 768w, https://dailydarkweb.net/wp-content/uploads/2024/07/incident-000279-750x445.png 750w, https://dailydarkweb.net/wp-content/uploads/2024/07/incident-000279-1140x676.png 1140w\" sizes=\"(max-width: 679px) 100vw, 679px\"></a></p>\n<p><strong>Additional Features:</strong></p>\n<ul>\n<li><em><strong>Offline Encryption Not Supported</strong>: Ensures the program operates only when connected to the internet.</em></li>\n<li><em><strong>Comprehensive Technical Support</strong>: Full user support through a dedicated team.</em></li>\n<li><em><strong>Undetectable</strong>: Strong protection against detection by security programs.</em></li>\n<li><em><strong>Optional File Types for Encryption</strong>: Users can choose specific file types to encrypt.</em></li>\n<li><em><strong>User-Friendly Dashboard</strong>: An easy-to-understand control panel for seamless operation.</em></li>\n<li><em><strong>Secure Communication</strong>: Effective and secure communication channels with victims.</em></li>\n<li><em><strong>Full Operator Support</strong>: Complete support from the operator team for users.</em></li>\n</ul>\n<p><a href=\"https://dailydarkweb.net/wp-content/uploads/2024/07/incident-000288.png\"><img data-dominant-color=\"5a1716\" data-has-transparency=\"true\" style=\"--dominant-color: #5a1716;\" loading=\"lazy\" decoding=\"async\" class=\"has-transparency alignnone  wp-image-3813\" src=\"https://dailydarkweb.net/wp-content/uploads/2024/07/incident-000288.png\" alt=\"\" width=\"721\" height=\"248\" srcset=\"https://dailydarkweb.net/wp-content/uploads/2024/07/incident-000288.png 1367w, https://dailydarkweb.net/wp-content/uploads/2024/07/incident-000288-300x103.png 300w, https://dailydarkweb.net/wp-content/uploads/2024/07/incident-000288-1024x353.png 1024w, https://dailydarkweb.net/wp-content/uploads/2024/07/incident-000288-768x265.png 768w, https://dailydarkweb.net/wp-content/uploads/2024/07/incident-000288-750x258.png 750w, https://dailydarkweb.net/wp-content/uploads/2024/07/incident-000288-1140x393.png 1140w\" sizes=\"(max-width: 721px) 100vw, 721px\"></a></p>\n<p>The ransomware program is priced at <strong>$1500</strong>, providing lifetime access to the C2 dashboard via the Tor network.</p>\n<p><em><strong>You can contact us for Indicator of Compromise (IOCs)</strong></em></p>\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>"
  },
  {
    "title": "National Public Database Allegedly Partially Leaked",
    "date": "July 23, 2024",
    "url": "https://dailydarkweb.net/national-public-database-allegedly-partially-leaked/",
    "content": "<div class=\"content-inner \">\n\t\t\t\t\t\t\t\t<p>According to a threat actor, the National Public Database was partially leaked. It is stated that the data breach resulted in the leak of nearly 80 gigabytes of sensitive data from the National Public Data Database.</p>\n<p>In the forum post, it was stated that a 37GB file that was inside the “google links.” is the same data published by pompompedo (250M US Household). Therefore the threat actor didn’t include this data to their release. A sample file has been shared as part of the leak.</p>\n<p>The alleged breach was credited to a threat actor under the moniker “Sxul” and stressed that it was not “UsDoD”. The threat actor also indicates that another forum user “Alexa69” is in relation with them.</p>\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>"
  },
  {
    "title": "Threat Actor Offers Unauthorized Access to Hosting Provider Infrastructure, Including 120K Domains, for $80,000",
    "date": "April 10, 2024",
    "url": "https://dailydarkweb.net/threat-actor-offers-unauthorized-access-to-hosting-provider-infrastructure-including-120k-domains-for-80000/",
    "content": "<div class=\"content-inner \">\n\t\t\t\t\t\t\t\t<p>In a concerning development, a threat actor has surfaced, purporting to sell unauthorized access to a hosting provider infrastructure. With a purported control over a vast network of more than 120,000 registered domains, the offering includes coveted privileges such as root access and administrative panel control. The hosting provider’s revenue, estimated at approximately $16 million, underscores the scale of the operation. Moreover, the actor claims to provide access to all top-level domains (.tld) and boasts a comprehensive dataset exceeding 50 terabytes, accessible through administrative panels including cPanel, WHM, and VNC. The price tag attached to this illicit access stands at a staggering $80,000, raising significant concerns about the potential misuse and security implications of such unauthorized access.</p>\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>"
  }
]
