[
    {
        "date": "2024-06-11",
        "victim": "Mercatino dell'usato",
        "domain": "mercatinousato.com",
        "country": "ITA",
        "summary": "A hacker attack hit Mercatino dell'usato, stealing customer information. The objective of the computer attack was to demand a ransom from this leading second-hand sales chain.",
        "title": "The hacker attack on the second-hand market: customer information stolen",
        "url": "https://roma.repubblica.it/cronaca/2024/06/12/news/lattacco_hacker_al_mercatino_dellusato_rubate_le_informazioni_sui_clienti-423217462/",
        "added": "2024-06-12"
    },
    {
        "date": "2024-06-10",
        "victim": "Toronto District School Board (TDSB)",
        "domain": "tdsb.on.ca",
        "country": "CAN",
        "summary": "The Toronto District School Board (TDSB) was the victim of a ransomware cyberattack, affecting its testing technology environment, without impacting operational systems. An investigation is underway with the assistance of Toronto Police and external experts to assess the incident and determine whether any personal information was compromised. The TDSB has activated its cybersecurity response plan and will notify affected individuals if personal data is involved, while continuing to communicate on the progress of the investigation.",
        "title": "News: Letter Re: Cyber Incident | Toronto District School Board",
        "url": "https://www.tdsb.on.ca/home/ctl/Details/mid/43823/itemid/316",
        "added": "2024-06-12"
    },
    {
        "date": "2024-06-09",
        "victim": "Emcali",
        "domain": "emcali.com.co",
        "country": "COL",
        "summary": "Emcali, a state-owned company in Colombia, successfully blocked a major cyberattack that aimed to disrupt its business and billing systems. The attack, which began on June 9, was contained in less than two hours thanks to the rapid intervention of the company's security team. Investigations are underway to determine the motivations and perpetrators of the attack, which appeared to have extortion or sabotage objectives.",
        "title": "Emcali managed to block a major cyber attack in record time: how did they do it? Details of a high-level operation",
        "url": "https://www.semana.com/nacion/cali/articulo/emcali-logro-en-tiempo-record-bloquear-gran-ataque-cibernetico-como-lo-hicieron-detalles-de-una-operacion-de-alto-nivel/202442/",
        "added": "2024-06-11"
    },
    {
        "date": "2024-06-09",
        "victim": "Hands, The Family Network",
        "domain": "thefamilyhelpnetwork.ca",
        "country": "CAN",
        "summary": "Hands, The Family Network in North Bay, was the victim of a cyberattack and took immediate action to isolate systems and contain the threat. An investigation is underway to determine whether any personal information was compromised, and affected individuals will be notified accordingly. The impact on customer services has been minimal, according to Hands, who has hired cybersecurity experts to assist with remediation and investigation.",
        "title": "Hands dealing with cyber attack - North Bay News",
        "url": "https://www.baytoday.ca/local-news/hands-dealing-with-cyber-attack-9057843",
        "added": "2024-06-10"
    },
    {
        "date": "2024-06-09",
        "victim": "Cleveland",
        "domain": "clevelandohio.gov",
        "country": "USA",
        "summary": "The City of Cleveland is investigating a cyberattack, called a \"cyber incident,\" that resulted in the closure of City Hall and Erieview offices. Affected systems have been taken offline to be secured and safely restored. Emergency services, such as police, fire and emergency medical services, are not affected.",
        "title": "Cleveland cyber incident",
        "url": "https://fox8.com/news/cleveland-city-hall-investigating-cyber-incident-i-team/",
        "added": "2024-06-10"
    },
    {
        "date": "2024-06-08",
        "victim": "Findlay Automotive Group",
        "domain": "findlayauto.com",
        "country": "USA",
        "summary": "The Findlay Automotive group, which operates 17 automobile dealerships in several American states, was the victim of a cyberattack which affected some of its computer systems. The investigation is ongoing with the assistance of cybersecurity experts and law enforcement, but sales and service operations are currently restricted. The company and its dealership websites are still accessible, but employees cannot access computer networks.",
        "title": "Findlay Automotive Group hit by cyberattack | Business",
        "url": "https://www.reviewjournal.com/business/cybersecurity-attack-impacts-sales-service-at-nevada-automotive-group-3066257/",
        "added": "2024-06-11"
    },
    {
        "date": "2024-06-08",
        "victim": "Mobile County Health Department",
        "domain": "mchd.org",
        "country": "USA",
        "summary": "The Mobile County Health Department shut down its computer network after detecting suspicious activity, suggesting a possible cyberattack. Officials are working with IT security consultants to determine the extent of the incident and have notified the appropriate authorities. Health department services are expected to be available Monday, with some possible modifications.",
        "title": "Mobile County Health Department investigating possible cyber attack - al.com",
        "url": "https://www.al.com/news/2024/06/mobile-county-health-department-investigating-possible-cyber-attack.html",
        "added": "2024-06-10"
    },
    {
        "date": "2024-06-08",
        "victim": "KADOKAWA",
        "domain": "kadokawa.co.jp",
        "country": "JPN",
        "summary": "The Japanese group KADOKAWA suffered a cyberattack which made several of its websites inaccessible, notably the official website and the online service platforms Nico Nico and Ebten. The attack was discovered on June 8 and investigations are ongoing to determine the scale of the incident and whether any information was compromised. The group is working with external experts and authorities to resolve the incident and protect its systems.",
        "title": "Regarding the occurrence of outages on multiple KADOKAWA Group websites | Press release from KADOKAWA Corporation",
        "url": "https://prtimes.jp/main/html/rd/p/000014844.000007006.html",
        "added": "2024-06-10"
    },
    {
        "date": "2024-06-06",
        "victim": "ASST Rhodense",
        "domain": "asst-rhodense.it",
        "country": "ITA",
        "summary": "ASST Rhodense, an Italian healthcare facility, was the victim of a cyberattack that knocked out its IT systems. Hackers demand a ransom in exchange for data restoration. Details of the attack and the ransom demanded are not specified.",
        "title": "Hacker attack on Asst Rhodense, computer systems down. Ransom demanded",
        "url": "https://www.rainews.it/tgr/lombardia/articoli/2024/06/attacco-hacker-allasst-rhodense-sistemi-informatici-in-tilt-5fa93ac7-6ef1-4d95-b27f-0ab87db8a8ec.html",
        "added": "2024-06-06"
    },
    {
        "date": "2024-06-04",
        "victim": "Groupe IPM",
        "domain": "ipmgroup.be",
        "country": "BEL",
        "summary": "The IPM media group was the victim of a cyberattack, but the details of the incident have not yet been clarified. The company confirmed the attack and said it was investigating the incident. The consequences of the cyberattack on the group's activities and user data are not yet clear.",
        "title": "Media from the IPM group victims of a cyberattack - Le Soir",
        "url": "https://www.lesoir.be/592913/article/2024-06-05/des-medias-belges-victimes-dune-cyberattaque",
        "added": "2024-06-05"
    },
    {
        "date": "2024-06-04",
        "victim": "Synnovis",
        "domain": "synnovis.co.uk",
        "country": "GBR",
        "summary": "Two London hospitals, Guy’s and St Thomas’ and Kings College, have declared a critical incident after a major IT outage, possibly due to a cyber attack. Transplant surgery at the Royal Brompton and Harefield has been canceled, with neighboring hospitals taking on additional patients. The incident affects the services of Synnovis, of the Synlab group, disrupting in particular the pathology laboratories and blood transfusions, which led to the cancellation or redirection of certain activities.",
        "title": "Exclusive: Cyber attack strikes multiple hospitals | News | Health Service Journal",
        "url": "https://www.hsj.co.uk/quality-and-performance/exclusive-cyber-attack-strikes-multiple-hospitals/7037260.article",
        "added": "2024-06-04"
    },
    {
        "date": "2024-06-04",
        "victim": "Vietnam Post Corporation (Vietnam Post)",
        "domain": "vietnampost.vn",
        "country": "VNM",
        "summary": "Vietnam Post was hit by a ransomware attack at 3:10 a.m. on June 4, disrupting postal and delivery services. The attack had a direct impact on the company's operations. Details on the scale of the attack and response measures are not yet available.",
        "title": "Ransomware attack hits Vietnam Post | Vietnam+ (VietnamPlus)",
        "url": "https://en.vietnamplus.vn/ransomware-attack-hits-vietnam-post-post288028.vnp",
        "added": "2024-06-04"
    },
    {
        "date": "2024-06-02",
        "victim": "Institut technologique de Sonora (Itson)",
        "domain": "itson.edu.mx",
        "country": "MEX",
        "summary": "The Sonora Technological Institute (Itson) was the victim of a cyberattack, where a virus was planted on the central campus, affecting the university's servers and Wi-Fi connections. IT teams worked to identify and resolve the issue, while alternative communications systems were put in place to allow academic and administrative activities to continue. Classes continued normally, without interruption, despite the disruption caused by the attack.",
        "title": "Itson suffers cyber attack in Cajeme; They plant a cyber virus on the downtown campus - Diario del Yaqui",
        "url": "https://diariodelyaqui.mx/ciudadobregon/itson-sufre-ciberataque-en-cajeme-plantan-virus-cibernetico-en-el-campus-centro/84832",
        "added": "2024-06-03"
    },
    {
        "date": "2024-05-31",
        "victim": "SchoolHandle",
        "domain": "schoolhandle.com",
        "country": "MLT",
        "summary": "The online school management system SchoolHandle, used by private and Catholic schools, was the victim of a cyberattack on May 31. A judicial and police investigation is underway, and affected potential customers have been notified. Schools have asked their users to change their passwords as a precautionary measure.",
        "title": "Online school system suffers cyberattack",
        "url": "https://timesofmalta.com/article/online-school-system-suffers-cyberattack.1093704",
        "added": "2024-06-10"
    },
    {
        "date": "2024-05-30",
        "victim": "Newfoundland Broadcasting Company Limited (NBCL)",
        "domain": "ntv.ca",
        "country": "CAN",
        "summary": "Newfoundland Broadcasting Company Limited, owner of NTV and OZFM, was the victim of a recent cyberattack. The incident did not affect the broadcast operations of NTV and OZFM, but resulted in unauthorized access to some information in the system environment. The company works with cybersecurity experts to understand how the information was obtained and to mitigate any potential impact on employees and stakeholders.",
        "title": "Newfoundland Broadcasting Co. victim of cyberattack - NTV",
        "url": "https://ntv.ca/newfoundland-broadcasting-co-victim-of-cyberattack/",
        "added": "2024-05-31"
    },
    {
        "date": "2024-05-29",
        "victim": "Boyertown Area School District",
        "domain": "boyertownasd.org",
        "country": "USA",
        "summary": "The Boyertown Area School District in Berks and Montgomery counties in Pennsylvania canceled the last two days of classes due to technical issues with its network servers, affecting heating and cooling systems, as well as telephone and intercom. District buildings will be closed Thursday and Friday, but the graduation ceremony will take place as scheduled. Students and families are encouraged to follow instructions provided by the district to resolve technical issues.",
        "title": "Boyertown Area School District cancels last 2 days of classes in Berks, Montgomery counties due to network server issues - 6abc Philadelphia",
        "url": "https://6abc.com/post/boyertown-area-school-district-cancels-2-days-classes/14888892/",
        "added": "2024-05-31"
    },
    {
        "date": "2024-05-28",
        "victim": "Rigney Dolphin",
        "domain": "rigneydolphin.ie",
        "country": "IRL",
        "summary": "A Waterford-based call center, Rigney Dolphin, has been hit by a cyberattack, leading to restrictions on services, including for the HSE's medical helpline. The HSE said its systems, data and patient data were not impacted by the attack. Helpline services are expected to resume normal operation in the following days.",
        "title": "Waterford based call centre under cyber attack | WLRFM.com",
        "url": "https://www.wlrfm.com/news/waterford-based-call-centre-under-cyber-attack-362537",
        "added": "2024-06-04"
    },
    {
        "date": "2024-05-28",
        "victim": "Guardian Childcare",
        "domain": "guardian.edu.au",
        "country": "AUS",
        "summary": "Childcare provider Guardian Childcare, Victoria's largest, has been targeted by a cyberattack. The company confirmed that confidential data was compromised, but it did not specify what type of information was stolen. Investigations are ongoing to determine the extent of the security breach.",
        "title": "Guardian Childcare hack: Victoria's largest childcare provider targeted in cyber attack",
        "url": "https://www.9news.com.au/national/guardian-childcare-victoria-suffers-cyber-attack-affecting-thousands-of-families/cdf9d285-4ece-413c-8f43-8413f6ff1825",
        "added": "2024-05-30"
    },
    {
        "date": "2024-05-28",
        "victim": "Smith & Caughey's",
        "domain": "smithandcaugheys.co.nz",
        "country": "NZL",
        "summary": "Auckland department store Smith & Caughey's was the victim of a cyber attack, which affected its internal IT systems, on the same day it announced its planned closure in 2025. The attack resulted in the loss of access to its server and retail systems, which are now \"crypto-locked\". Smith & Caughey's chairman Tony Caughey described the incident as an \"unprecedented challenge\" for the company.",
        "title": "Smith & Caughey’s set to close: Department store falls victim to cyberattack on day of proposal to close for good - NZ Herald",
        "url": "https://www.nzherald.co.nz/nz/smith-caugheys-set-to-close-department-store-falls-victim-to-cyber-attack-on-day-of-proposal-to-close-for-good/G25KF73IOFCX5C7CV32RS3LEPE/",
        "added": "2024-05-29"
    },
    {
        "date": "2024-05-28",
        "victim": "Kantonsschule Frauenfeld",
        "domain": "ksf.ch",
        "country": "CHE",
        "summary": "Kantonsschule Frauenfeld was the victim of a cyberattack, resulting in loss of access to the internet and internal systems. Students, whose final exams are approaching, can no longer access course materials stored on the school's systems. The school's director confirmed that the institution was targeted by a computer attack.",
        "title": "Cyber ​​attack on Frauenfeld Cantonal School",
        "url": "https://www.tagblatt.ch/ostschweiz/frauenfeld/cyberkriminalitaet-ploetzlich-ging-gar-nichts-mehr-kurz-vor-den-abschlusspruefungen-kommt-es-zu-einem-cyberangriff-auf-die-kantonsschule-frauenfeld-ld.2625144",
        "added": "2024-05-29"
    },
    {
        "date": "2024-05-28",
        "victim": "Uniprévoyance",
        "domain": "uniprevoyance.fr",
        "country": "FRA",
        "summary": "Uniprévoyance says it has been the victim of a computer attack that has forced it to shut down all of its tools. Its teams, assisted by experts, are working to identify the damage and restore the situation as quickly as possible.",
        "title": "",
        "url": "https://nanao.cybtex.fr/@minus/112523568369091981",
        "added": "2024-05-29"
    },
    {
        "date": "2024-05-27",
        "victim": "The Billericay School",
        "domain": "billericayschool.com",
        "country": "GBR",
        "summary": "The school in Billericay, Essex, has declared a “critical situation” after being targeted by a cyberattack during the half-term holidays. The school's systems were compromised despite having industry-standard firewalls and anti-malware security in place. The school will be closed for some students on Monday to allow staff to prepare to teach lessons without access to their usual resources.",
        "title": "The Billericay School faces critical incident after cyber attack",
        "url": "https://www.bbc.com/news/articles/cl44877v7xxo",
        "added": "2024-06-01"
    },
    {
        "date": "2024-05-26",
        "victim": "Center Line Public Schools",
        "domain": "clps.org",
        "country": "USA",
        "summary": "Center Line School District in Michigan was hit by a ransomware cyberattack, which forced the school to close on Tuesday. IT teams were able to contain the attack and schools will reopen on Wednesday, May 29. A third-party team has been hired to assess the attack and ensure the district’s operations are secure.",
        "title": "Center Line Public Schools set to reopen after cyberattack",
        "url": "https://www.clickondetroit.com/news/local/2024/05/28/center-line-public-schools-set-to-reopen-after-cyberattack/",
        "added": "2024-05-29"
    },
    {
        "date": "2024-05-26",
        "victim": "La ville de Dammartin-en-Goële",
        "domain": "dammartin-en-goele.fr",
        "country": "FRA",
        "summary": "The town of Dammartin-en-Goële was the victim of a “major” cyberattack on Sunday May 26, leading to the infection of numerous files and folders with malware. City services have been operating in “degraded” mode since Sunday evening, and investigations are underway to assess the extent of the impact of the attack. Server cleaning and reconstruction operations are underway to return to normal as soon as possible.",
        "title": "Seine-et-Marne: the town of Dammartin-en-Goële victim of a “major” cyberattack",
        "url": "https://www.bfmtv.com/paris/seine-et-marne-la-ville-de-dammartin-en-goele-victime-d-une-cyberattaque-majeure_AN-202405280581.html",
        "added": "2024-05-28"
    },
    {
        "date": "2024-05-25",
        "victim": "Seattle Public Library",
        "domain": "spl.org",
        "country": "USA",
        "summary": "The Seattle Public Library was the victim of a ransomware cyberattack, which rendered its online services, including its catalog and circulation system, inaccessible. Systems were taken offline to investigate the incident and restore security. The library is still open for borrowing books and physical materials, but online services remain unavailable until further notice.",
        "title": "West Seattle Blog… | FOLLOWUP: Seattle Public Library says ‘ransomware event’ keeping its online services offline",
        "url": "https://westseattleblog.com/2024/05/followup-seattle-public-library-says-ransomware-event-keeping-its-online-services-offline/",
        "added": "2024-05-28"
    },
    {
        "date": "2024-05-24",
        "victim": "Mobitwin",
        "domain": "mobitwin.be",
        "country": "BEL",
        "summary": "A cyberattack targeted the company Mobitwin, which provides a transport service for people with reduced mobility, which made the online reservation system inaccessible. Users can no longer plan their trips and customer data is no longer accessible. Users are encouraged to contact the transportation service directly to plan their trips.",
        "title": "Cyber ​​attack disrupts transport planning for people with reduced mobility (Kruibeke) | Het Nieuwsblad",
        "url": "https://www.nieuwsblad.be/cnt/dmf20240528_95024372",
        "added": "2024-05-28"
    },
    {
        "date": "2024-05-24",
        "victim": "Islamabad Safe City Authority",
        "domain": "islamabadpolice.gov.pk",
        "country": "PAK",
        "summary": "The Islamabad Safe City Authority's online system was taken offline after an attempted computer intrusion, which allowed hackers to access the main server and sensitive data. Officials closed all access to the system to prevent possible further damage. The investigation found that simple, commonly used passwords and logins by officials left the system vulnerable to intrusion.",
        "title": "Islamabad Safe City’s online system shut down after hacking attempt - Pakistan - DAWN.COM",
        "url": "https://www.dawn.com/news/1835677/islamabad-safe-citys-online-system-shut-down-after-hacking-attempt",
        "added": "2024-05-28"
    },
    {
        "date": "2024-05-24",
        "victim": "Comté d'Albany",
        "domain": "albanycounty.com",
        "country": "USA",
        "summary": "Albany County is investigating a possible cyberattack that potentially compromised its servers, with a full analysis underway in conjunction with the New York State Department of Homeland Security and Incident Response Team cybernetics of emergency services. The attack appears to have caused minimal disruption to services, with no evidence of unauthorized data extraction.",
        "title": "Albany County investigates possible cyberattack",
        "url": "https://www.timesunion.com/news/article/albany-county-investigates-possible-cyberattack-19476770.php",
        "added": "2024-05-26"
    },
    {
        "date": "2024-05-23",
        "victim": "Le département de la Justice et du Développement constitutionnel (DJ&CD)",
        "domain": "justice.gov.za",
        "country": "ZAF",
        "summary": "South Africa's Department of Justice and Constitutional Development (DJ&CD) was hit by a cyberattack that affected child support payments. An investigation team was assembled to look into suspicious activities and manual payments were put in place for beneficiaries. This is the second time DJ&CD has been the victim of a cyberattack, following a ransom attack in 2021 which resulted in a R5 million fine.",
        "title": "Justice department suffers another cyber attack | ITWeb",
        "url": "https://www.itweb.co.za/article/justice-department-suffers-another-cyber-attack/rW1xLv5nJkx7Rk6m",
        "added": "2024-05-27"
    },
    {
        "date": "2024-05-22",
        "victim": "Jumbo Group",
        "domain": "jumbogroup.sg",
        "country": "SGP",
        "summary": "The Jumbo Group was the victim of a ransomware attack and reported the incident to the relevant authorities, including the police and data protection and network security agencies. According to initial investigations, no data leak was detected and the incident did not have a significant impact on the group's operations. The group is conducting a thorough investigation into the incident and will take steps to strengthen the security of its network.",
        "title": "Jumbo Restaurant Group: The company was attacked by ransomware and has reported it to the police - 8world",
        "url": "https://www.8world.com/singapore/jumbo-group-ransomware-incident-2462466",
        "added": "2024-05-23"
    },
    {
        "date": "2024-05-21",
        "victim": "Top-Medien",
        "domain": "toponline.ch",
        "country": "CHE",
        "summary": "The Top-Medien media group, which includes Radio Top and Tele Top, has been the victim of a cyberattack by a Trojan that infected and encrypted several servers, causing disruptions in the online, radio and television media offering. The attack began on 21 May 2024 and technical teams are working with external experts to assess the extent of the attack and restore affected data and programmes. Radio Top management said the attack was massive and that Top-Medien was under pressure.",
        "title": "Trojan paralyzes parts of top media | IT market",
        "url": "https://www.it-markt.ch/news/2024-05-22/trojaner-legt-teile-von-top-medien-lahm",
        "added": "2024-05-23"
    },
    {
        "date": "2024-05-21",
        "victim": "Le Cup (Centre Unique de Programmation)",
        "domain": "asur.marche.it",
        "country": "ITA",
        "summary": "The online appointment booking system of the Cup (Single Programming Center) was the victim of a cyberattack or infiltration, making it impossible to make an appointment. Officials are working to resolve the issue. No further details were provided about the incident.",
        "title": "Booking a visit is impossible, the Cup has gone haywire: cyber attack or infiltration. \"We are making up for it\" - Laprovinciadifermo.com",
        "url": "https://www.laprovinciadifermo.com/prenotare-una-visita-e-impossibile-il-cup-e-andato-in-tilt-attacco-informatico-o-infiltrazioni-stiamo-rimediando/",
        "added": "2024-05-23"
    },
    {
        "date": "2024-05-20",
        "victim": "Hong Kong Institute of Contemporary Culture Lee Shau Kee School of Creativity",
        "domain": "creativehk.edu.hk",
        "country": "HKG",
        "summary": "A Hong Kong educational institution, the Hong Kong Institute of Contemporary Culture Lee Shau Kee School of Creativity, was the victim of a ransomware cyberattack, resulting in the leak of personal data of more than 600 people. The hackers encrypted 8TB of data, including information on the school's students, teachers and tenants. This incident is part of a series of cyber attacks targeting institutions in Hong Kong, including schools, hospitals and technology parks.",
        "title": "Over 600 people's personal data stolen after school server hacked",
        "url": "https://hongkongfp.com/2024/05/21/over-600-peoples-personal-data-stolen-after-school-server-hacked-in-latest-cyberattack-on-local-entities/",
        "added": "2024-05-23"
    },
    {
        "date": "2024-05-19",
        "victim": "Okayama Psychiatric Medical Center",
        "domain": "okayama-u.ac.jp",
        "country": "JPN",
        "summary": "The Okayama Psychiatric Care Center in Japan was the victim of a ransomware cyberattack, leading to the leak of personal data of up to 40,000 patients, including their names, addresses, dates of birth and medical information. The attack took place on May 19 and was detected the next day. The hospital has apologized and is working to limit the damage.",
        "title": "A Japanese mental hospital was attacked by a cyber attack and the information of up to 40,000 patients was leaked - International - Hong Kong Wenhui.com",
        "url": "https://www.wenweipo.com/a/202406/11/AP66681d7ce4b05df3a51f0541.html",
        "added": "2024-06-11"
    },
    {
        "date": "2024-05-19",
        "victim": "Malheur County",
        "domain": "mahleurco.org",
        "country": "USA",
        "summary": "Malheur County avoided a serious breach of its online security thanks to a quick response from its information team, which detected and thwarted a hacking attempt on May 19. The attack was detected early Sunday morning and the systems were secured within 20 minutes, preventing data loss and election disruption. The investigation is ongoing to determine the hackers' motives and the county is working to strengthen its online security with the help of cybersecurity company ProJen.",
        "title": "Malheur County dodges online breach attempt - Malheur Enterprise",
        "url": "https://www.malheurenterprise.com/2024/05/29/malheur-county-dodges-online-breach-attempt/",
        "added": "2024-05-29"
    },
    {
        "date": "2024-05-17",
        "victim": "AddComm",
        "domain": "addComm.nl",
        "country": "NLD",
        "summary": "AddComm, a healthcare services company, was the victim of a ransomware cyberattack, resulting in the leak of sensitive data, including social security numbers (BSN). Users are concerned about the security of their data and criticize the way authorities have handled similar cases in the past. The stolen data could be used to commit fraud, particularly in the insurance sector.",
        "title": "AddComm hit by ransomware, delivered water board tax assessments - Computer - News - Tweakers",
        "url": "https://tweakers.net/nieuws/222286/addcomm-getroffen-door-ransomware-leverde-aanslagen-van-waterschapsbelasting.html",
        "added": "2024-05-23"
    },
    {
        "date": "2024-05-16",
        "victim": "American Radio Relay League (ARRL)",
        "domain": "arrl.org",
        "country": "USA",
        "summary": "The American Radio Relay League (ARRL), the national amateur radio association in the United States, has confirmed that it was the victim of a cyberattack that affected its systems and services, including its \"Logbook of The World\" database. . The attack compromised sensitive information such as addresses and phone numbers, but not Social Security numbers or credit card information. This cyberattack comes against a backdrop of numerous attacks against critical infrastructure, particularly in the health sector.",
        "title": "American Radio Relay League Confirms Cyberattack Disrupted Operations | Tech Times",
        "url": "https://www.techtimes.com/articles/304782/20240519/american-radio-relay-league-confirms-cyberattack-disrupting-operations.htm",
        "added": "2024-05-20"
    },
    {
        "date": "2024-05-15",
        "victim": "Central Contra Costa Transit Authority (County Connection)",
        "domain": "ccta.net",
        "country": "USA",
        "summary": "The Central Contra Costa Transit Authority, a bus and paratransit operator in California, suffered a cyberattack, which allowed an unauthorized actor to access files and data stored in its network. The investigation is ongoing to determine what specific data was compromised, but there is no evidence yet that any financial information or Social Security numbers were stolen. The bus operator is taking steps to secure its network and plans to notify affected individuals once the investigation is complete.",
        "title": "Central Contra Costa Transit Authority experiences cyber security data breach | KRON4",
        "url": "https://www.kron4.com/news/bay-area/contra-costa-transit-authority-experiences-cyber-security-data-breach/",
        "added": "2024-05-20"
    },
    {
        "date": "2024-05-15",
        "victim": "Le Collège Ahuntsic",
        "domain": "collegeahuntsic.qc.ca",
        "country": "CAN",
        "summary": "Collège Ahuntsic in Montreal closed its doors on May 16 due to a potential cyberattack, leading to the cancellation of all teaching and continuing education activities. Students and employees were asked not to use college computers during the investigation. The college announced that it is expected to resume operations on May 17, but without services such as the library and cafeteria.",
        "title": "A potential cyberattack causes the closure of Ahuntsic College | TVA News",
        "url": "https://www.tvanouvelles.ca/2024/05/16/une-potentielle-cyberattaque-provoque-la-fermeture-du-college-ahuntsic",
        "added": "2024-05-20"
    },
    {
        "date": "2024-05-15",
        "victim": "Ranzijn",
        "domain": "ranzijn.nl",
        "country": "NLD",
        "summary": "The Ranzijn chain of veterinary clinics in the Netherlands was the victim of a cyberattack, resulting in the theft of data on animals and their owners. The company warns its customers to be vigilant for possible phishing emails that may be sent in its name. The details of the incident are not yet clear, but the company is taking steps to protect customer data.",
        "title": "Veterinary practice Ran is a victim of cyber attack: animal and owner data stolen | West Betuwe | AD.nl",
        "url": "https://www.ad.nl/west-betuwe/dierenartspraktijk-ranzijn-slachtoffer-van-cyberaanval-gegevens-van-dieren-en-baasjes-gestolen~a6bc2e82/",
        "added": "2024-05-20"
    },
    {
        "date": "2024-05-15",
        "victim": "Rockford Public Schools",
        "domain": "rockfordschools.org",
        "country": "USA",
        "summary": "The Rockford, Michigan school district was hit by a ransomware cyberattack, shutting down its computer network and phones. School officials took steps to protect the data and contacted the FBI to investigate the incident. Classes continue as normal, but without access to technology, students and teachers must use more traditional methods.",
        "title": "Rockford Public Schools ransomware update | wzzm13.com",
        "url": "https://www.wzzm13.com/article/news/local/rockford-public-schools-ransomware-attack/69-b80e015e-2310-43aa-859b-b17f1678e591",
        "added": "2024-05-16"
    },
    {
        "date": "2024-05-15",
        "victim": "MediSecure",
        "domain": "medisecure.com.au",
        "country": "AUS",
        "summary": "Here is the summary of the article:\n\nThe Australian Federal Police are investigating a ransomware cyberattack on healthcare company, MediSecure, which resulted in a data breach. The Australian government has put in place a coordinated response to handle the incident, with Cybersecurity Minister Clare O'Neil calling for no speculation about the affected company. The incident raises concerns about the health care sector's vulnerability to cybercriminal attacks.",
        "title": "Data breach: Healthcare ransomware attack at MediSecure investigated by Australian Federal Police",
        "url": "https://www.smh.com.au/technology/police-investigate-large-scale-healthcare-data-breach-20240516-p5je66.html",
        "added": "2024-05-16"
    },
    {
        "date": "2024-05-13",
        "victim": "St. Helena",
        "domain": "cityofsthelena.com",
        "country": "USA",
        "summary": "The city of St. Helena was the victim of a cyberattack that affected its computers and servers, forcing limits on public services. Cybersecurity experts are investigating the incident and trying to determine what the hackers may have gained access to. City services, such as the library and water bill payments, are disrupted, but police, fire and wastewater services are operating normally.",
        "title": "St. Helena limiting services amid cyberattack - The Press Democrat",
        "url": "https://www.pressdemocrat.com/article/north-bay/cyberattack-virus-st-helena-napa-valley/",
        "added": "2024-06-04"
    },
    {
        "date": "2024-05-13",
        "victim": "First Nations Health Authority (FNHA)",
        "domain": "fnha.ca",
        "country": "CAN",
        "summary": "British Columbia's First Nations Health Authority (FNHA) was the victim of a cyberattack that compromised personal information of employees and others. The incident was detected on May 13 and measures were taken to block unauthorized access and prevent further illicit activities. The investigation is ongoing and the relevant authorities have been notified, but no clinical information has been compromised.",
        "title": "Cyberattack hits B.C.'s First Nations Health Authority | CTV News",
        "url": "https://bc.ctvnews.ca/b-c-s-first-nations-health-authority-hit-by-cyberattack-1.6897203",
        "added": "2024-05-23"
    },
    {
        "date": "2024-05-13",
        "victim": "L'aéroport et l'école de commerce de Pau",
        "domain": "pau.aeroport.fr",
        "country": "FRA",
        "summary": "The Pau airport and business school were victims of a cyberattack, causing disruptions to their activities. The details of the attack and its consequences have not yet been clarified. Investigations are underway to determine the origin and motivations of this attack.",
        "title": "Pau airport and business school victims of cyber attack - France Bleu",
        "url": "https://www.francebleu.fr/infos/faits-divers-justice/l-aeroport-et-l-ecole-de-commerce-de-pau-victimes-d-une-cyberattaque-6303207",
        "added": "2024-05-16"
    },
    {
        "date": "2024-05-13",
        "victim": "Universidad Complutense de Madrid",
        "domain": "ucm.es",
        "country": "ESP",
        "summary": "The Universidad Complutense de Madrid has been the victim of a cyberattack targeting the application that manages internships in companies, which may have exposed student data. The incident affected one of the university's systems, putting the confidentiality of students' information at risk. The details of the attack and the extent of the data leak are not yet known.",
        "title": "The Complutense University of Madrid suffers a cyberattack on the application that manages company practices that \"may have exposed\" student data - El Correo de Pozuelo",
        "url": "https://elcorreodepozuelo.com/2024/05/13/la-universidad-complutense-de-madrid-sufre-un-ciberataque-en-la-aplicacion-que-gestiona-practicas-de-empresa-que-ha-podido-exponer-datos-de-alumnos/",
        "added": "2024-05-15"
    },
    {
        "date": "2024-05-12",
        "victim": "Union Township School District",
        "domain": "utsd.org",
        "country": "USA",
        "summary": "The Union Township School District was the victim of a cyberattack that resulted in network disruption. Details of the incident are not yet available. The investigation is ongoing to determine the extent of the attack and the measures to be taken to restore network security.",
        "title": "Union Township School District Cyberattack Causes Network Disruption: Details Inside",
        "url": "https://nj1015.com/hackers-hit-another-new-jersey-school-district/",
        "added": "2024-05-15"
    },
    {
        "date": "2024-05-12",
        "victim": "Travelite Holdings Ltd.",
        "domain": "etravelite.com",
        "country": "SGP",
        "summary": "Travelite Holdings Ltd. was the victim of a ransomware cyberattack, which compromised sensitive information on its IT servers, including company, employee and customer data. The company is working with IT experts and lawyers to resolve the issue and has negotiated a potential ransom payment of US$250,000. Relevant authorities, including the police and the Singapore Privacy Commission, have been informed of the incident.",
        "title": "Travelite Holdings Hit by Major Cyberattack - TipRanks.com",
        "url": "https://www.tipranks.com/news/company-announcements/travelite-holdings-hit-by-major-cyberattack",
        "added": "2024-05-15"
    },
    {
        "date": "2024-05-12",
        "victim": "Christie's",
        "domain": "christies.com",
        "country": "CHE",
        "summary": "Auction house Christie's has postponed a sale of rare watches in Geneva due to a \"technical security issue\". The sale, which was to take place on Monday, was postponed to the following Tuesday. Details about the nature of the security issue are unclear, but the auction house said it had taken its website offline.",
        "title": "Christie's postpones watch auction due to 'security problem'",
        "url": "https://www.welingelichtekringen.nl/economie/christies-stelt-horlogeveiling-uit-om-beveiligingsprobleem",
        "added": "2024-05-15"
    },
    {
        "date": "2024-05-11",
        "victim": "Wehrle-Werk AG",
        "domain": "wehrle-werk.de",
        "country": "DEU",
        "summary": "The German company Wehrle-Werk AG, based in Emmendingen, was the victim of a cyberattack on May 11. Since then, the company's production and communication have operated on a limited basis. Crews are currently working to restore systems to restore normal operations.",
        "title": "Cyberattack on Wehrle-Werk AG - Emmendingen - Badische Zeitung",
        "url": "https://www.badische-zeitung.de/cyberattacke-auf-wehrle-werk-ag",
        "added": "2024-05-23"
    },
    {
        "date": "2024-05-08",
        "victim": "Ascension Health",
        "domain": "ascension.org",
        "country": "USA",
        "summary": "Ascension Health, a healthcare company, is investigating a cyberattack that affected some systems in its technology network. Access to some systems has been interrupted, but the company has implemented procedures to ensure patient care continues securely and with minimal impact. If sensitive information is compromised, affected individuals will be notified.",
        "title": "Ascension Health investigates cyber security issue, assures minimal patient impact",
        "url": "https://fox11online.com/news/local/ascension-health-investigates-cyber-security-issue-assures-minimal-patient-impact-st-elizabeth-appleton-calumet-chilton-mercy-oshkosh-activity-information",
        "added": "2024-05-09"
    },
    {
        "date": "2024-05-07",
        "victim": "Mālama I Ke Ola Health Center",
        "domain": "ccmaui.org",
        "country": "USA",
        "summary": "Mālama I Ke Ola Health Center suffered an IT security breach which disrupted some of its operations. Teams are currently working to restore systems and identify potentially compromised data. Patients can continue to receive basic health care at the health center, but some electronic activities are currently unavailable.",
        "title": "Aloha Patients & Community",
        "url": "https://www.ccmaui.org",
        "added": "2024-05-28"
    },
    {
        "date": "2024-05-06",
        "victim": "Trego County Lemke Memorial Hospital",
        "domain": "tclmh.org",
        "country": "USA",
        "summary": "A hospital in northwest Kansas has been the victim of a cyberattack. The article does not provide details on the nature of the attack or what data was compromised. No other information is available about the incident.",
        "title": "Northwest Kansas hospital hit by cyberattack | 101.3 KFDI",
        "url": "https://www.kfdi.com/2024/05/22/northwest-kansas-hospital-hit-by-cyberattack/",
        "added": "2024-05-23"
    },
    {
        "date": "2024-05-06",
        "victim": "Key Tronic Corporation",
        "domain": "keytronic.com",
        "country": "USA",
        "summary": "Key Tronic Corporation detected unauthorized access to portions of its information technology systems on May 6, 2024. The company activated its cyber incident procedures to investigate and contain the attack, collaborating with external cybersecurity experts and notifying authorities. The incident resulted in disruption and access limitations to some of the company's business applications, but it believes the unauthorized activity has been contained and is working to restore affected systems. To date, the company does not believe the incident will have a material impact on its business or financial results.",
        "title": "FORM 8-K",
        "url": "https://www.sec.gov/Archives/edgar/data/719733/000071973324000015/ktcc-20240506.htm",
        "added": "2024-05-09"
    },
    {
        "date": "2024-05-06",
        "victim": "DocGo",
        "domain": "docgo.com",
        "country": "USA",
        "summary": "Mobile healthcare company DocGo was the victim of a cyberattack, in which protected health data was stolen from a limited number of health records. The company took steps to contain the incident and hired cybersecurity experts to investigate. The compromised data only relates to the ambulance transportation business in the United States and DocGo is in the process of contacting affected individuals.",
        "title": "DocGo discloses cyberattack after hackers steal patient health data",
        "url": "https://www.bleepingcomputer.com/news/security/docgo-discloses-cyberattack-after-hackers-steal-patient-health-data/",
        "added": "2024-05-08"
    },
    {
        "date": "2024-05-05",
        "victim": "Palomar Health",
        "domain": "palomarhealth.org",
        "country": "USA",
        "summary": "Palomar Health Medical Group was the victim of a cyberattack, leading to problems for patients who cannot pick up their prescriptions and have difficulty accessing their medical records. The company said 80% of its operations should be restored within a week. Ransomware attacks against hospitals have increased by 300% and are often linked to Russian hackers, according to a cybersecurity expert.",
        "title": "Suspected cyberattack creating headaches for patients of Palomar Health",
        "url": "https://www.10news.com/news/local-news/suspected-cyberattack-creating-headaches-for-patients-of-palomar-health-medical-group",
        "added": "2024-05-29"
    },
    {
        "date": "2024-05-05",
        "victim": "Concord Public Schools et Concord-Carlisle Regional School District",
        "domain": "concordps.org",
        "country": "USA",
        "summary": "Concord Public Schools and the Concord-Carlisle Regional School District were victims of a cyberattack, which resulted in a ransom demand and affected home computers. Security teams are working to restore systems and contain the attack, while school cafeterias will be taking cash for snacks due to the disruption. The investigation is ongoing to determine whether sensitive data was compromised.",
        "title": "Report: Concord schools hit with cyber attack",
        "url": "https://www.bostonglobe.com/2024/05/07/metro/report-concord-schools-hit-with-cyber-attack/",
        "added": "2024-05-08"
    },
    {
        "date": "2024-05-05",
        "victim": "Université de Sienne",
        "domain": "unisi.it",
        "country": "ITA",
        "summary": "The University of Siena was the victim of a cyberattack by a group of international hackers, requiring the shutdown of its network to check and clean the infrastructure. University IT managers have informed the National Cybersecurity Agency and are preparing a complaint to the postal police and the personal data protection authority. The university network will be gradually restored once security conditions are guaranteed.",
        "title": "University of Siena network hit by hacker attack",
        "url": "https://sienafree.it/157720-infrastruttura-di-rete-delluniversita-di-siena-colpita-da-attacco-hacker",
        "added": "2024-05-06"
    },
    {
        "date": "2024-05-05",
        "victim": "Wichita",
        "domain": "wichita.gov",
        "country": "USA",
        "summary": "Wichita shut down its computer network following a malware attack. Some services are temporarily unavailable. External specialists help restore the network, without a specific deadline. Emergency services are operating, but online payments are suspended.",
        "title": "Wichita reports cyberattack on city computer network | 101.3 KFDI",
        "url": "https://www.kfdi.com/2024/05/05/wichita-reports-cyberattack-on-city-computer-network/",
        "added": "2024-05-06"
    },
    {
        "date": "2024-05-04",
        "victim": "Regional Cancer Center (RCC)",
        "domain": "rcctvm.gov.in",
        "country": "IND",
        "summary": "A cyberattack from abroad has disrupted radiotherapy treatments at the Regional Cancer Centre (RCC) in India, affecting 14 servers, 11 of which have been recovered, with treatment scheduled to resume next week. Authorities are considering terrorism charges against the perpetrators, similar to a previous case involving Chinese hackers who attacked Delhi's AIIMS in 2022.",
        "title": "Radiation treatment within one week: Cyber ​​attack on RCC from abroad; charges of terrorism to be charged against accused - KERALA - GENERAL | Kerala Kaumudi Online",
        "url": "https://keralakaumudi.com/en/news/news.php?id=1298702&u=radiation-treatment-within-one-week-cyber-%E2%80%8B%E2%80%8Battack-on-rcc-from-abroad-charges-of-terrorism-to%C2%A0be-charged%C2%A0against-accused",
        "added": "2024-05-04"
    },
    {
        "date": "2024-05-03",
        "victim": "Coradix-Magnescan",
        "domain": "radiologie-perpignan.fr",
        "country": "FRA",
        "summary": "The Coradix-Magnescan medical radiology group was the victim of a cyberattack which affected several of its medical imaging sites in the Pyrénées-Orientales. The relevant authorities have been informed and an investigation is underway to discover the origin of the attack, but so far no data breach has been detected. The imaging center teams are working to ensure that examinations are carried out in the best possible conditions despite a degraded operating mode.",
        "title": "Pyrénées-Orientales: several medical imaging sites victims of a cyberattack - lindependant.fr",
        "url": "https://www.lindependant.fr/2024/05/07/pyrenees-orientales-de-nombreux-sites-dimagerie-medicale-victimes-dune-cyberattaque-11936827.php",
        "added": "2024-05-07"
    },
    {
        "date": "2024-05-03",
        "victim": "Cégep de Lanaudière",
        "domain": "cegep-lanaudiere.qc.ca",
        "country": "CAN",
        "summary": "The Cégep de Lanaudière was the victim of a cyberattack on Friday, which led to the closure of the three schools today and tomorrow. The investigation is ongoing with a cybersecurity firm and experts are monitoring the \"Dark Web\" for possible data leaks. An action plan has been put in place to get the servers back up and running and a communication will be sent on Tuesday to reveal the procedure to follow.",
        "title": "The three constituents of Cégep de Lanaudière victims of a cyberattack",
        "url": "https://monjoliette.com/les-trois-constituantes-du-cegep-de-lanaudiere-victimes-dune-cyberattaque/",
        "added": "2024-05-06"
    },
    {
        "date": "2024-05-03",
        "victim": "Eucatex (EUCA4)",
        "domain": "eucatex.com.br",
        "country": "BRA",
        "summary": "Eucatex (EUCA4) was the victim of a cyberattack, leading to the paralysis of its ERP and email system. The databases remained intact, and the company assures that no loss or leak of data was noted. The issue has been resolved, and systems are being restored, with normalization expected in the coming hours.",
        "title": "Eucatex (EUCA4) reports cyber attack and says there is no evidence of losses and leaks - SpaceMoney",
        "url": "https://www.spacemoney.com.br/investimentos/acoes/eucatex-euca4-comunica-ataque-cibernetico/207434/",
        "added": "2024-05-03"
    },
    {
        "date": "2024-05-02",
        "victim": "Ewing Marion Kauffman School",
        "domain": "kauffmanschool.org",
        "country": "USA",
        "summary": "Ewing Marion Kauffman School in Kansas City was the victim of a ransomware cyberattack in May, shutting down the school for a day. The stolen information was posted online, sparking concerns about the security of student data. The school is working with law enforcement and cybersecurity experts to investigate the incident and notify those affected.",
        "title": "Ewing Marion Kauffman School latest victim of cyberattack",
        "url": "https://fox4kc.com/news/kansas-city-charter-school-latest-cyberattack-victim/",
        "added": "2024-05-20"
    },
    {
        "date": "2024-05-02",
        "victim": "Umeå universitet",
        "domain": "umu.se",
        "country": "SWE",
        "summary": "ITS, the IT Support and Systems Development unit at Umeå University, discovered the cyberattack at 08:30 on May 2. Immediate and extensive troubleshooting efforts were undertaken, as well as other measures to stop the attack, in collaboration with external specialists.",
        "title": "Umeå University exposed to extensive cyber attack",
        "url": "https://www.umu.se/nyheter/umea-universitet-utsatt-for-omfattande-cyberattack_11935138/",
        "added": "2024-05-02"
    },
    {
        "date": "2024-05-01",
        "victim": "Brandywine Realty Trust",
        "domain": "brandywinerealty.com",
        "country": "USA",
        "summary": "Brandywine Realty Trust suffered a data breach, where an unauthorized third party accessed parts of its internal network, disrupting some of its internal operations. The company has taken steps to contain the incident and is currently assessing the extent of the breach, but has not yet determined whether any personal information was compromised. The investigation is ongoing, but no group or individual has claimed responsibility for the attack.",
        "title": "Operations Disrupted After Brandywine Realty Trust Data Breach",
        "url": "https://thecyberexpress.com/brandywine-realty-trust-data-breach-confirmed/",
        "added": "2024-05-08"
    },
    {
        "date": "2024-04-30",
        "victim": "CentroMed",
        "domain": "centromedsa.com",
        "country": "USA",
        "summary": "The computer network of CentroMed, a San Antonio-based health care provider, was hacked, resulting in unauthorized access to personal patient information, including names, addresses, dates of birth, Social Security numbers and information financial. The investigation revealed that the hackers accessed CentroMed's systems on April 30, 2024. CentroMed began notifying affected patients and implemented additional security measures to prevent such attacks in the future.",
        "title": "CentroMed computer network hacked, patients personal information ‘acquired,’ investigation reveals",
        "url": "https://www.ksat.com/news/local/2024/05/17/centromed-computer-network-hacked-patients-personal-information-acquired-investigation-reveals/",
        "added": "2024-05-20"
    },
    {
        "date": "2024-04-30",
        "victim": "City of Helsinki",
        "domain": "hel.fi",
        "country": "FIN",
        "summary": "The city of Helsinki suffered a data breach that affected tens of thousands of students, tutors and staff, exposing personal and confidential information. The investigation is ongoing to determine the extent and impact of the incident, which was caused by the exploitation of an unpatched vulnerability in the Education Division's network. The city has already implemented security measures to prevent further attacks.",
        "title": "City of Helsinki suffered a data breach",
        "url": "https://securityaffairs.com/163088/data-breach/city-of-helsinki-data-breach.html",
        "added": "2024-05-15"
    },
    {
        "date": "2024-04-30",
        "victim": "Université de Guyane",
        "domain": "univ-guyane.fr",
        "country": "GUF",
        "summary": "The University of Guyana was the victim of a cyberattack which resulted in the encryption and deletion of some files, as well as the destruction of the faculty's website. The hackers demand a ransom in exchange for the return of the data, but management refuses to pay. An investigation is underway to determine the origin of the attack and assess the damage.",
        "title": "University of Guyana victim of cyberattack",
        "url": "https://www.franceguyane.fr/actualite/education-sante-environnement/luniversite-de-guyane-victime-dune-cyberattaque-986312.php",
        "added": "2024-05-07"
    },
    {
        "date": "2024-04-30",
        "victim": "Mineola Union Free School District",
        "domain": "mineola.k12.ny.us",
        "country": "USA",
        "summary": "School officials confirmed that a cyberattack occurred at the Mineola Union Free School District, causing an internet and phone outage. A message sent to parents revealed that the cause of the outage was a cyberattack, and that steps were being taken with the security provider to restore service. The district expects to have internet and phone access restored by Wednesday night, in time for the resumption of classes on Thursday.",
        "title": "School officials: Cyberattack causes internet, phone outage at Mineola Public Schools",
        "url": "https://longisland.news12.com/school-officials-cyberattack-causes-internet-phone-outage-at-mineola-public-schools",
        "added": "2024-05-02"
    },
    {
        "date": "2024-04-29",
        "victim": "Universidad de las Américas de Puebla (UDLAP)",
        "domain": "udlap.mx",
        "country": "MEX",
        "summary": "The Universidad de las Américas de Puebla (UDLAP) suffered a cyberattack that disrupted its internet services and technology platforms. The situation was contained, identified and mitigated using the university's defense systems, with assistance from cybersecurity partners Dell and Palo Alto. Services are being restored, including the Blackboard platform which is already operational, although access requires a specific temporary link.",
        "title": "Alert in the UDLAP: Suffering from a cyber attack",
        "url": "https://www.diariocambio.com.mx/2024/educacion/alerta-en-la-udlap-sufre-ataque-cibernetico/",
        "added": "2024-05-01"
    },
    {
        "date": "2024-04-28",
        "victim": "Firstmac",
        "domain": "firstmac.com.au",
        "country": "AUS",
        "summary": "Firstmac, an Australian lender, was the victim of a cyberattack by the EMBARGO ransomware group, which stole more than 500 GB of data, including databases, source codes and sensitive customer information. The company hired experts to investigate the incident and took steps to secure its system. The incident is part of a series of attacks targeting Australian financial institutions, leading government and industry to strengthen their defenses against cyber threats.",
        "title": "Firstmac hacked by ransomware gang - Mortgage Business",
        "url": "https://www.mortgagebusiness.com.au/lender/19018-non-bank-lender-hacked",
        "added": "2024-05-09"
    },
    {
        "date": "2024-04-28",
        "victim": "London Drugs",
        "domain": "londondrugs.com",
        "country": "CAN",
        "summary": "London Drugs, a retail and pharmacy chain operating nearly 80 stores across British Columbia, Alberta, Saskatchewan and Manitoba, has closed its doors until further notice following a cyberattack occurred on Sunday, April 28, 2024. The company took this action as a precaution and claimed to have no reason to believe that customer or employee data was affected, while retaining third-party experts to contain and investigate the incident. incident. Despite store closures, pharmacy staff remain on site to meet customers' urgent needs.",
        "title": "London Drugs closes stores until further notice due to cyberattack",
        "url": "https://www.cbc.ca/lite/story/1.7187615",
        "added": "2024-05-01"
    },
    {
        "date": "2024-04-27",
        "victim": "La Superintendencia del Subsidio Familiar",
        "domain": "ssf.gov.co",
        "country": "COL",
        "summary": "The Superintendencia del Subsidio Familiar in Colombia has reported problems in its information systems since Saturday, April 27, due to a cyberattack. Superintendent Angie Katherine Monroy Bobadilla confirmed that this is a breach of data security and privacy, and measures are being taken to protect databases and avoid disclosure of sensitive information . Complaints have been filed with the relevant authorities and efforts are underway in collaboration with the ColCERT of the ICT Ministry to resolve the situation and protect the entity's information.",
        "title": "Cyber ​​attack affects the Family Subsidy Superintendency | RCN Radio",
        "url": "https://www.rcnradio.com/colombia/ataque-cibernetico-afecta-a-la-superintendencia-del-subsidio-familiar",
        "added": "2024-05-01"
    },
    {
        "date": "2024-04-26",
        "victim": "Hong Kong Arts Development Council",
        "domain": "hkadc.org.hk",
        "country": "HKG",
        "summary": "On April 26, the Hong Kong Arts Development Council's IT system suffered a malicious cyberattack, partially affecting its operations. The organization immediately activated an emergency response mechanism to prevent further intrusions and hired cybersecurity experts to investigate and repair the system, without any data leaks, including those of grant applicants. has been detected at this stage. The incident was reported to the Office of the Privacy Commissioner for Personal Data and the Hong Kong Police, as well as the Cultural, Sports and Tourism Affairs Bureau.",
        "title": "The Hong Kong Arts Development Council's network was attacked and no data leakage has been found yet | am730",
        "url": "https://www.am730.com.hk/本地/香港藝發局網絡遭攻擊-暫未發現有資料洩露-/448793",
        "added": "2024-05-01"
    },
    {
        "date": "2024-04-25",
        "victim": "La Nación",
        "domain": "lanacion.com.ar",
        "country": "ARG",
        "summary": "Buenos Aires newspaper La Nación reported a computer attack on Thursday, triggering the technology team's security protocols. Unusual server activity resulted in a disruption of internal systems, requiring the intervention of a team of cybersecurity specialists. Despite technical problems, the printed edition of the Friday newspaper was affected, but website updates and broadcasting of the LN+ channel continued normally.",
        "title": "The newspaper La Nación victim of a cyberattack - World News",
        "url": "https://www.nouvelles-du-monde.com/le-journal-la-nacion-victime-dune-cyberattaque/",
        "added": "2024-05-01"
    },
    {
        "date": "2024-04-25",
        "victim": "Kansas City Scout",
        "domain": "kcscout.net",
        "country": "USA",
        "summary": "An important service for Kansas City area drivers is down Thursday due to a cyberattack. Kansas City Scout said its systems have been down since early morning, including its website, traffic camera network and billboards in the area. The Missouri Department of Transportation said systems were taken offline immediately to limit damage from the attack, the nature of which was not specified. There is currently no timeline for the restoration, but KC Scout says staff is working to fix it as soon as possible.",
        "title": "Kansas City Scout cyberattack: Traffic camera system down",
        "url": "https://fox4kc.com/news/kansas-city-scout-systems-down-following-cyberattack/",
        "added": "2024-04-26"
    },
    {
        "date": "2024-04-25",
        "victim": "Ville de Gravelines",
        "domain": "ville-gravelines.fr",
        "country": "FRA",
        "summary": "The town of Gravelines was targeted by a cyberattack, leading to the disconnection of all servers and the restriction of internet access for municipal services, as a precautionary measure. At present, the origin of the attack has not been identified. Despite this, the town hall and municipal services remain accessible by telephone, although certain operations are temporarily no longer possible.",
        "title": "The town of Gravelines victim of a cyberattack, services to the population restricted - La Voix du Nord",
        "url": "https://www.lavoixdunord.fr/1455837/article/2024-04-25/la-ville-de-gravelines-victime-d-une-cyberattaque-les-services-la-population",
        "added": "2024-04-25"
    },
    {
        "date": "2024-04-23",
        "victim": "Municipalité de La Guadeloupe",
        "domain": "munlaguadeloupe.qc.ca",
        "country": "CAN",
        "summary": "The city's computer systems were disconnected and IT and cybersecurity experts took charge. Specialized analysts are investigating the incident and the impacts on data on computer servers.",
        "title": "Cyberattack at the Municipality of La Guadeloupe - L’Éclaireur Progrès",
        "url": "https://www.leclaireurprogres.ca/faits-divers/cyberattaque-a-la-municipalite-de-la-guadeloupe/",
        "added": "2024-04-27"
    },
    {
        "date": "2024-04-23",
        "victim": "Skanlog",
        "domain": "skanlog.com",
        "country": "SWE",
        "summary": "A ransomware-type cyberattack has been launched against Skanlog, a major distributor for Systembolaget in Sweden, leading to distribution issues and the possibility of some products being sold out before the weekend. Skanlog management confirmed that the attack has crippled their system until a solution can be found to restore it. As a result, Systembolaget, which is affected by the disruption, anticipates that this could impact the availability of some beverage categories, although there is no immediate risk of all shelves being empty.",
        "title": "Hacker attacks can result in empty shelves at Systembolaget - E24",
        "url": "https://e24.no/internasjonal-oekonomi/i/5EJxXE/hackerangrep-kan-gi-tomme-hyller-hos-systembolaget",
        "added": "2024-04-24"
    },
    {
        "date": "2024-04-22",
        "victim": "Ville d’Albi",
        "domain": "mairie-albi.fr",
        "country": "FRA",
        "summary": "The town hall of Albi, in Tarn, has suffered a cyberattack since April 22, 2024, resulting in the inaccessibility of its telephone numbers, emails and IT services. Municipal services are striving to restore normal operations while ensuring the continuity of public service. The nature and origin of the attack have not been revealed, but a complaint was filed by the town hall with the police.",
        "title": "A cyberattack in progress at the town hall of Albi - France Bleu",
        "url": "https://www.francebleu.fr/infos/faits-divers-justice/une-cyber-attaque-en-cours-a-la-mairie-d-albi-6909499",
        "added": "2024-04-23"
    },
    {
        "date": "2024-04-20",
        "victim": "Petit commerce à Bad Wörishofen",
        "domain": "n/a",
        "country": "DEU",
        "summary": "A small business in Bad Wörishofen fell victim to a cyberattack last weekend, resulting in damage estimated at around 30,000 euros after all data on the owner's PC was encrypted by hackers. The owner immediately contacted the local police, and investigations are now being carried out by the specialist cybercrime department of KPI Memmingen, with the help of an external IT service provider.",
        "title": "Bad Wörishofen: Cyber ​​attack on business - About 30,000 euros in damage",
        "url": "https://www.merkur.de/bayern/schwaben/mindelheim-kurier/bad-woerishofen-cyberangriff-auf-gewerbebetrieb-etwa-30-000-euro-schaden-93028864.html",
        "added": "2024-04-24"
    },
    {
        "date": "2024-04-20",
        "victim": "Coppel",
        "domain": "coppel.com",
        "country": "MEX",
        "summary": "The Coppel store chain in Mexico suffered a cyberattack that caused malfunctions in several of its IT systems, suspending many services, including the use of its applications. Coppel confirmed the cybersecurity incident after a thorough investigation and has strengthened its security measures, while clarifying that its stores continue to operate normally.",
        "title": "Coppel suffered a cyber attack and debts are eliminated",
        "url": "https://el-mexicano.com/nacional/coppel-sufrio-ataque-cibernetico-y-eliminan-deudas/2201651",
        "added": "2024-04-23"
    },
    {
        "date": "2024-04-20",
        "victim": "仁安醫院 (Union Hospital)",
        "domain": "union.org",
        "country": "HKG",
        "summary": "The Union Hospital system's network was attacked by hackers, partially affecting its operations, but so far no leaks or misuse of patient data have been detected. The attack was identified as a \"LockBit\" ransomware attack, with the hackers demanding a US$10 million ransom, which the hospital did not pay. Experts suggest the attack could be due to systems not being updated or employees opening phishing emails, highlighting the importance of updating systems and security awareness.",
        "title": "Union Hospital network was attacked by hackers and said no leakage of patient information was found | Local | Commercial Radio 881903",
        "url": "https://www.881903.com/news/local/2529350/仁安醫院網絡遭黑客攻擊-稱未發現病人資料洩漏",
        "added": "2024-04-20"
    },
    {
        "date": "2024-04-19",
        "victim": "Salamander",
        "domain": "salamander.de",
        "country": "DEU",
        "summary": "Shoe manufacturer Salamander was the victim of a cyberattack, causing its internet presence to be taken offline and disruptions to its more than sixty stores since April 19. Klauser GmbH & Co KG, owner of Salamander, had to shut down its IT systems but managed to restore essential business processes at the end of April, although the online sales site remained unusable.",
        "title": "Cyber ​​attack: Salamander shoes offline after attack | heise online",
        "url": "https://www.heise.de/news/Schuhhaendler-Salamander-nach-Cyberattacke-offline-9707690.html",
        "added": "2024-05-03"
    },
    {
        "date": "2024-04-19",
        "victim": "Ordre des infirmières et infirmiers du Québec (OIIQ)",
        "domain": "oiiq.org",
        "country": "CAN",
        "summary": "The Order of Nurses of Quebec (OIIQ) was the victim of a ransomware cyberattack, resulting in the online publication of sensitive personal data of its members, including information such as contact details, social insurance numbers, and more. The hackers demanded a US$200,000 ransom for not disclosing or deleting the 112 gigabytes of stolen data. The OIIQ is conducting an in-depth investigation to secure its IT environment, while Quebec's largest nurses' union organization is closely monitoring the situation, and the government seems ineffective in the face of increasing ransomware attacks.",
        "title": "Ransomware attack | Data leak on Quebec nurses | The Press",
        "url": "https://www.lapresse.ca/actualites/2024-04-23/attaque-au-rancongiciel/fuite-de-donnees-sur-les-infirmieres-du-quebec.php",
        "added": "2024-04-24"
    },
    {
        "date": "2024-04-19",
        "victim": "Swisspro",
        "domain": "swisspro.ch",
        "country": "CHE",
        "summary": "Swisspro companies, part of BKW Building Solutions, were hit by a ransomware attack in early April, affecting their legacy IT environment. A taskforce has been set up to assess the impact and possible consequences of the attack, while taking immediate measures such as isolating affected systems and changing passwords. There has been no indication of outbound attacks affecting customers or other companies within BKW, and Swisspro is able to continue providing its services.",
        "title": "Swisspro group victim of ransomware attack | ICTjournal",
        "url": "https://www.ictjournal.ch/news/2024-04-22/le-groupe-swisspro-victime-dune-attaque-par-ransomware",
        "added": "2024-04-23"
    },
    {
        "date": "2024-04-18",
        "victim": "Carpetright",
        "domain": "carpetright.co.uk",
        "country": "GBR",
        "summary": "Carpetright, a British flooring retail chain, was the victim of a cyberattack by unknown hackers who used malware to gain unauthorized access to its network. The attack disrupted hundreds of customer orders and forced the company to take its network offline at its head office in Purfleet, Essex, also affecting phone lines. The company isolated the virus before any data was stolen and advised that neither customer nor employee data was impacted, while continuing to investigate and restore systems.",
        "title": "Carpetright customers hit by cyber attack as firm struggles to fill orders after hackers target company HQ | The Sun",
        "url": "https://www.thesun.co.uk/money/27434828/carpetright-orders-disrupted-cyber-attack-hack/",
        "added": "2024-04-20"
    },
    {
        "date": "2024-04-18",
        "victim": "Floirac",
        "domain": "floirac.fr",
        "country": "FRA",
        "summary": "Since Thursday evening, Floirac municipal services have been facing a cyberattack, leading to a cut in Internet access and making digital operations impossible. The community assures that no data has been stolen or any system damaged, but the services are currently operating in degraded mode. Investigations to determine the origin of the attack are continuing, and the reopening of online procedures is expected in the coming hours.",
        "title": "Cyberattack stopped in Floirac: municipal services nevertheless deprived of Internet this Friday",
        "url": "https://www.sudouest.fr/gironde/floirac/cyberattaque-stoppee-a-floirac-les-services-municipaux-neanmoins-prives-d-internet-ce-vendredi-19397237.php",
        "added": "2024-04-20"
    },
    {
        "date": "2024-04-18",
        "victim": "Synlab",
        "domain": "synlab.it",
        "country": "ITA",
        "summary": "Synlab, a medical services provider also operating in Brescia, was targeted by a cyberattack that affected its IT systems throughout Italy, forcing the company to deactivate all of its IT systems in the country. As a result, all activities at sampling points, medical centers and laboratories in Italy are suspended until further notice, including the uploading and collection of medical reports. Synlab apologizes for the inconvenience caused and will inform its customers and patients of the evolution of the situation via its social networks, without being able to specify when operations will be able to resume.",
        "title": "Hacker attack on Synlab, all clinics in Italy closed and IT services ko | Brescia newspaper",
        "url": "https://www.giornaledibrescia.it/cronaca/attacco-hacker-a-synlab-chiusi-tutti-gli-ambulatori-in-italia-e-servizi-informatici-ko-nb8oqg3e",
        "added": "2024-04-19"
    },
    {
        "date": "2024-04-17",
        "victim": "Barnett's Couriers",
        "domain": "barnetts.con.au",
        "country": "AUS",
        "summary": "Wollongong-based company Barnett's Couriers has been seriously affected by a cyber attack. Initially, the company informed customers via email that it hoped to resume operations after Friday, April 19. However, a new email sent Monday morning revealed that the company anticipated its systems would remain down for another week.",
        "title": "Wollongong firm Barnett's Couriers left reeling from cyber attack | Illawarra Mercury | Wollongong, NSW",
        "url": "https://www.illawarramercury.com.au/story/8601158/wollongong-firm-barnetts-couriers-left-reeling-from-cyber-attack/",
        "added": "2024-04-23"
    },
    {
        "date": "2024-04-17",
        "victim": "Écoles du comté de Glynn",
        "domain": "glynn.k12.ga.us",
        "country": "USA",
        "summary": "A cyberattack on Glynn County Schools' IT infrastructure Wednesday knocked out internet connections throughout the system, causing an outage that persisted Thursday and is expected to last through Friday. No sensitive information would have been compromised according to a school official. The school's IT team and a third-party monitoring program detected suspicious activity on the network, resulting in the Internet being shut down to prevent intrusion.",
        "title": "School system hit by cyberattck, shuts down internet, programs | Local News | thebrunswicknews.com",
        "url": "https://thebrunswicknews.com/breaking/school-system-hit-by-cyberattack-shuts-down-internet-programs/article_8674a373-f472-56a3-a237-b88abd4cf357.html",
        "added": "2024-04-19"
    },
    {
        "date": "2024-04-17",
        "victim": "Legislative Bill Drafting Commission",
        "domain": "nyassembly.gov",
        "country": "USA",
        "summary": "A cyberattack targeted the New York State Bill Drafting Commission, disrupting the drafting and publication of bills for the FY 2025 spending plan and causing a delay in the passage of the state budget. Details of the attack, such as its origin, the data compromised, and the extent of the damage, remained unclear, but efforts were underway to find temporary solutions and prevent significant delays in the budget process.",
        "title": "Cyberattack on NY bill drafting commission causes delay in state budget passage | Globe Echo",
        "url": "https://globeecho.com/cyberattack-on-ny-bill-drafting-commission-causes-delay-in-state-budget-passage/",
        "added": "2024-04-18"
    },
    {
        "date": "2024-04-16",
        "victim": "Groupe Tea",
        "domain": "teaspa.it",
        "country": "ITA",
        "summary": "The Comune di Mantova was the victim of a cyberattack on April 16, 2024, which affected certain technological applications of the Tea company. According to investigators, there was no loss or permanent deletion of personal data, but a criminal group claimed responsibility for the exfiltration of certain information, including personal data. Investigations are continuing to determine the nature and extent of the violation of confidentiality of personal data processed in the name and on behalf of the Comune di Mantova.",
        "title": "Announcement from the Municipality of Mantua",
        "url": "https://www.comune.mantova.it/tutte-le-notizie/comunicati-stampa/4400-attacco-informatico-comunicato-del-comune-di-mantova",
        "added": "2024-05-11"
    },
    {
        "date": "2024-04-16",
        "victim": "Vooruit.brussels",
        "domain": "vooruit.brussels",
        "country": "BEL",
        "summary": "Hackers carried out a cyberattack on the Vooruit.brussels server, stealing personal data such as members' names, addresses and telephone numbers, with a ransom demand of 800 euros. Suzy Bleys, co-president of Vooruit.brussels, reported the incident after the site became inaccessible and the criminal gang contacted them asking for money in Bitcoin. Authorities have been informed and an investigation into the data breach is underway to determine the extent of the compromised information.",
        "title": "Personal data leaked at Vooruit.brussels: 'Hackers demand 800 euros in ransom' | BRUZZ",
        "url": "https://www.bruzz.be/actua/politiek/datalek-bij-vooruitbrussels-hackers-vragen-800-euro-losgeld-2024-04-18",
        "added": "2024-04-19"
    },
    {
        "date": "2024-04-16",
        "victim": "Norrmjerier",
        "domain": "norrmjerier.se",
        "country": "SWE",
        "summary": "On Tuesday morning, a cyberattack was discovered against Norrmjerier in Umeå, Norran reports. Operations had to be stopped and crisis management activated.",
        "title": "Cyber ​​attack on dairy - production halted",
        "url": "https://omni.se/cyberattack-mot-mejeri-produktionen-stoppas/a/yE1Ova",
        "added": "2024-04-17"
    },
    {
        "date": "2024-04-16",
        "victim": "Hôpital Simone Veil à Cannes",
        "domain": "ch-cannes.fr",
        "country": "FRA",
        "summary": "The Simone Veil hospital in Cannes has suffered an IT \"blackout\" since Tuesday April 16, leading to the cancellation of interventions and appointments, suspected of being due to a cyber attack, although the hospital mentions officially a “technical incident in progress”. A crisis unit was activated in collaboration with various regional organizations to manage the situation. As a result, all non-urgent activities and consultations are postponed until the computer system is restored.",
        "title": "IT “black out” at Cannes hospital this Tuesday, “technical incident” or cyberattack? - Var-Matin",
        "url": "https://www.varmatin.com/sante/l-hopital-de-cannes-est-il-victime-d-une-cyber-attaque-915838",
        "added": "2024-04-17"
    },
    {
        "date": "2024-04-15",
        "victim": "Cenans",
        "domain": "",
        "country": "FRA",
        "summary": "The town hall was the victim of a cryptovirus, according to the Déclic association.",
        "title": "",
        "url": "https://www.linkedin.com/posts/asso-declic_attaques-cybersécurité-auprès-dorganismes-activity-7189253897910149120-m8_j/",
        "added": "2024-05-29"
    },
    {
        "date": "2024-04-15",
        "victim": "Katholische Jugendfürsorge der Diözese Augsburg (KJF)",
        "domain": "kjf-augsburg.de",
        "country": "DEU",
        "summary": "The Catholic Jugendfürsorge der Diözese Augsburg (KJF) was the victim of a professional cyberattack in mid-April, during which personal, financial, patient and health data were stolen from several of its establishments, including the largest maternity hospital in the region, the Josefinum in Augsburg. The hackers accessed parts of the KJF's IT infrastructure, but it appears that treatment documents or medical letters were not stolen. The KJF has set up a hotline for potentially affected people and advises changing passwords and carefully monitoring bank accounts to prevent theft.",
        "title": "Cyber ​​attack: Hackers steal data from patients at KJF Augsburg",
        "url": "https://www.augsburger-allgemeine.de/bayern/cyberangriff-hacker-stehlen-daten-von-patienten-der-kjf-augsburg-id70612686.html",
        "added": "2024-05-01"
    },
    {
        "date": "2024-04-15",
        "victim": "Comté de Coffee, Géorgie",
        "domain": "coffeecountygov.com",
        "country": "USA",
        "summary": "The IT infrastructure of Coffee County, Georgia, already at the center of controversy over allegations of fraud in the 2020 US presidential election, was the victim of a cyberattack in early April, resulting in its access to election systems being cut off from the state as a precautionary measure. No evidence of data exfiltration was found, but the malicious activity was detected by the Cybersecurity and Infrastructure Security Agency. This attack comes as other Georgia counties are embroiled in legal battles over attempted surrenders.",
        "title": "Cyberattack hits Georgia county at center of voting software breach | CyberScoop",
        "url": "https://cyberscoop.com/cyberattack-hits-georgia-county-at-center-of-voting-software-breach/",
        "added": "2024-04-27"
    }
]
