[
    {
        "date": "2024-05-30",
        "victim": "Newfoundland Broadcasting Company Limited (NBCL)",
        "domain": "ntv.ca",
        "country": "CAN",
        "summary": "La Newfoundland Broadcasting Company Limited, propriétaire de NTV et OZFM, a été victime d'une cyberattaque récente. L'incident n'a pas affecté les opérations de diffusion de NTV et OZFM, mais a entraîné un accès non autorisé à certaines informations dans l'environnement système. L'entreprise travaille avec des experts en cybersécurité pour comprendre comment les informations ont été obtenues et pour atténuer tout impact potentiel sur les employés et les parties prenantes.",
        "title": "Newfoundland Broadcasting Co. victim of cyberattack - NTV",
        "url": "https://ntv.ca/newfoundland-broadcasting-co-victim-of-cyberattack/",
        "added": "2024-05-31"
    },
    {
        "date": "2024-05-29",
        "victim": "Boyertown Area School District",
        "domain": "boyertownasd.org",
        "country": "USA",
        "summary": "Le district scolaire de Boyertown Area, dans les comtés de Berks et Montgomery en Pennsylvanie, a annulé les deux derniers jours de classe en raison de problèmes techniques avec ses serveurs de réseau, affectant les systèmes de chauffage et de climatisation, ainsi que les systèmes de téléphone et d'interphone. Les bâtiments du district seront fermés jeudi et vendredi, mais la cérémonie de remise des diplômes aura lieu comme prévu. Les élèves et les familles sont invités à suivre les instructions données par le district pour résoudre les problèmes techniques.",
        "title": "Boyertown Area School District cancels last 2 days of classes in Berks, Montgomery counties due to network server issues - 6abc Philadelphia",
        "url": "https://6abc.com/post/boyertown-area-school-district-cancels-2-days-classes/14888892/",
        "added": "2024-05-31"
    },
    {
        "date": "2024-05-28",
        "victim": "Guardian Childcare",
        "domain": "guardian.edu.au",
        "country": "AUS",
        "summary": "Le fournisseur de services de garde d'enfants Guardian Childcare, le plus grand de Victoria, a été ciblé par une cyberattaque. L'entreprise a confirmé que des données confidentielles avaient été compromises, mais elle n'a pas précisé quel type d'informations avait été volé. Les enquêtes sont en cours pour déterminer l'ampleur de la violation de la sécurité.",
        "title": "Guardian Childcare hack: Victoria's largest childcare provider targeted in cyber attack",
        "url": "https://www.9news.com.au/national/guardian-childcare-victoria-suffers-cyber-attack-affecting-thousands-of-families/cdf9d285-4ece-413c-8f43-8413f6ff1825",
        "added": "2024-05-30"
    },
    {
        "date": "2024-05-28",
        "victim": "Smith & Caughey's",
        "domain": "smithandcaugheys.co.nz",
        "country": "NZL",
        "summary": "Le grand magasin Smith & Caughey's d'Auckland a été victime d'une cyberattaque, qui a affecté ses systèmes informatiques internes, le même jour où il a annoncé sa fermeture prévue en 2025. L'attaque a entraîné la perte d'accès à ses systèmes de serveur et de vente au détail, qui sont maintenant \"crypto-verrouillés\". Le président de Smith & Caughey's, Tony Caughey, a décrit l'incident comme un \"défi sans précédent\" pour l'entreprise.",
        "title": "Smith & Caughey’s set to close: Department store falls victim to cyberattack on day of proposal to close for good - NZ Herald",
        "url": "https://www.nzherald.co.nz/nz/smith-caugheys-set-to-close-department-store-falls-victim-to-cyber-attack-on-day-of-proposal-to-close-for-good/G25KF73IOFCX5C7CV32RS3LEPE/",
        "added": "2024-05-29"
    },
    {
        "date": "2024-05-28",
        "victim": "Kantonsschule Frauenfeld",
        "domain": "ksf.ch",
        "country": "CHE",
        "summary": "La Kantonsschule Frauenfeld a été victime d'une cyberattaque, entraînant la perte d'accès à Internet et aux systèmes internes. Les élèves, dont les examens de fin d'études approchent, ne peuvent plus accéder au matériel de cours stocké sur les systèmes de l'école. La directrice de l'école a confirmé que l'institution a été ciblée par une attaque informatique.",
        "title": "Cyberangriff auf Kantonsschule Frauenfeld",
        "url": "https://www.tagblatt.ch/ostschweiz/frauenfeld/cyberkriminalitaet-ploetzlich-ging-gar-nichts-mehr-kurz-vor-den-abschlusspruefungen-kommt-es-zu-einem-cyberangriff-auf-die-kantonsschule-frauenfeld-ld.2625144",
        "added": "2024-05-29"
    },
    {
        "date": "2024-05-28",
        "victim": "Uniprévoyance",
        "domain": "uniprevoyance.fr",
        "country": "FRA",
        "summary": "Uniprévoyance se dit victime d’une attaque informatique qui l'a obligé à mettre à l’arrêt l’ensemble de ses outils. Ses équipes, assistées d’experts, travaillent à identifier les dommages et rétablir la situation dans les meilleurs délais.",
        "title": "",
        "url": "https://nanao.cybtex.fr/@minus/112523568369091981",
        "added": "2024-05-29"
    },
    {
        "date": "2024-05-26",
        "victim": "Center Line Public Schools",
        "domain": "clps.org",
        "country": "USA",
        "summary": "Le district scolaire de Center Line, au Michigan, a été victime d'une cyberattaque par ransomware, ce qui a entraîné la fermeture de l'école mardi. Les équipes d'informatique ont réussi à contenir l'attaque et les écoles rouvriront mercredi 29 mai. Une équipe de tiers a été engagée pour évaluer l'attaque et garantir la sécurité des opérations du district.",
        "title": "Center Line Public Schools set to reopen after cyberattack",
        "url": "https://www.clickondetroit.com/news/local/2024/05/28/center-line-public-schools-set-to-reopen-after-cyberattack/",
        "added": "2024-05-29"
    },
    {
        "date": "2024-05-26",
        "victim": "La ville de Dammartin-en-Goële",
        "domain": "dammartin-en-goele.fr",
        "country": "FRA",
        "summary": "La ville de Dammartin-en-Goële a été victime d'une cyberattaque \"majeure\" dimanche 26 mai, entraînant l'infection de nombreux fichiers et dossiers par un logiciel malveillant. Les services de la ville fonctionnent en mode \"dégradé\" depuis dimanche soir, et les investigations sont en cours pour évaluer l'étendue de l'impact de l'attaque. Les opérations de nettoyage et de reconstruction des serveurs sont en cours pour un retour à la normale dans les meilleurs délais.",
        "title": "Seine-et-Marne: la ville de Dammartin-en-Goële victime d'une cyberattaque \"majeure\"",
        "url": "https://www.bfmtv.com/paris/seine-et-marne-la-ville-de-dammartin-en-goele-victime-d-une-cyberattaque-majeure_AN-202405280581.html",
        "added": "2024-05-28"
    },
    {
        "date": "2024-05-25",
        "victim": "Seattle Public Library",
        "domain": "spl.org",
        "country": "USA",
        "summary": "La bibliothèque publique de Seattle a été victime d'une cyberattaque par ransomware, qui a rendu inaccessible ses services en ligne, y compris son catalogue et son système de prêt. Les systèmes ont été mis hors ligne pour enquêter sur l'incident et restaurer la sécurité. La bibliothèque est toujours ouverte pour les emprunts de livres et de matériaux physiques, mais les services en ligne restent indisponibles jusqu'à nouvel ordre.",
        "title": "West Seattle Blog… | FOLLOWUP: Seattle Public Library says ‘ransomware event’ keeping its online services offline",
        "url": "https://westseattleblog.com/2024/05/followup-seattle-public-library-says-ransomware-event-keeping-its-online-services-offline/",
        "added": "2024-05-28"
    },
    {
        "date": "2024-05-24",
        "victim": "Mobitwin",
        "domain": "mobitwin.be",
        "country": "BEL",
        "summary": "Une cyberattaque a visé la société Mobitwin, qui fournit un service de transport pour les personnes à mobilité réduite, ce qui a rendu inaccessible le système de réservation en ligne. Les utilisateurs ne peuvent plus planifier leurs déplacements et les données des clients ne sont plus accessibles. Les utilisateurs sont invités à contacter directement le service de transport pour planifier leurs déplacements.",
        "title": "Cyberaanval verstoort planning vervoer minder mobiele mensen (Kruibeke) | Het Nieuwsblad",
        "url": "https://www.nieuwsblad.be/cnt/dmf20240528_95024372",
        "added": "2024-05-28"
    },
    {
        "date": "2024-05-24",
        "victim": "Islamabad Safe City Authority",
        "domain": "islamabadpolice.gov.pk",
        "country": "PAK",
        "summary": "Le système en ligne de l'Autorité de la ville sécurisée d'Islamabad a été mis hors ligne après une tentative d'intrusion informatique, qui a permis à des hackers d'accéder au serveur principal et à des données sensibles. Les responsables ont fermé tous les accès au système pour prévenir d'éventuels dommages supplémentaires. L'enquête a révélé que des mots de passe et des identifiants simples et couramment utilisés par les officiels avaient rendu le système vulnérable à l'intrusion.",
        "title": "Islamabad Safe City’s online system shut down after hacking attempt - Pakistan - DAWN.COM",
        "url": "https://www.dawn.com/news/1835677/islamabad-safe-citys-online-system-shut-down-after-hacking-attempt",
        "added": "2024-05-28"
    },
    {
        "date": "2024-05-24",
        "victim": "Comté d'Albany",
        "domain": "albanycounty.com",
        "country": "USA",
        "summary": "Le comté d'Albany enquête sur une possible cyberattaque ayant potentiellement compromis ses serveurs, avec une analyse complète en cours en collaboration avec le Département de la Sécurité Intérieure de l'État de New York et l'équipe d'intervention en cas d'incident cybernétique des services d'urgence. L'attaque semble avoir causé une perturbation minimale des services, sans preuve d'extraction non autorisée de données.",
        "title": "Albany County investigates possible cyberattack",
        "url": "https://www.timesunion.com/news/article/albany-county-investigates-possible-cyberattack-19476770.php",
        "added": "2024-05-26"
    },
    {
        "date": "2024-05-23",
        "victim": "Le département de la Justice et du Développement constitutionnel (DJ&CD)",
        "domain": "justice.gov.za",
        "country": "ZAF",
        "summary": "Le département de la Justice et du Développement constitutionnel (DJ&CD) d'Afrique du Sud a été victime d'une cyberattaque qui a affecté les paiements de soutien aux enfants. Une équipe d'enquête a été assemblée pour examiner les activités suspectes et les paiements manuels ont été mis en place pour les bénéficiaires. C'est la deuxième fois que le DJ&CD est victime d'une cyberattaque, après une attaque par rançon en 2021 qui avait entraîné une amende de 5 millions de rands.",
        "title": "Justice department suffers another cyber attack | ITWeb",
        "url": "https://www.itweb.co.za/article/justice-department-suffers-another-cyber-attack/rW1xLv5nJkx7Rk6m",
        "added": "2024-05-27"
    },
    {
        "date": "2024-05-22",
        "victim": "Jumbo Group",
        "domain": "jumbogroup.sg",
        "country": "SGP",
        "summary": "Le groupe Jumbo a été victime d'une attaque de logiciel de rançon et a signalé l'incident aux autorités compétentes, notamment la police et les organismes de protection des données et de sécurité réseau. Selon les premières enquêtes, aucune fuite de données n'a été détectée et l'incident n'a pas eu d'impact significatif sur les opérations du groupe. Le groupe mène une enquête approfondie sur l'incident et prendra des mesures pour renforcer la sécurité de son réseau.",
        "title": "珍宝餐饮集团：公司受到勒索软件攻击 已报警 - 8world",
        "url": "https://www.8world.com/singapore/jumbo-group-ransomware-incident-2462466",
        "added": "2024-05-23"
    },
    {
        "date": "2024-05-21",
        "victim": "Top-Medien",
        "domain": "toponline.ch",
        "country": "CHE",
        "summary": "Le groupe de médias Top-Medien, qui comprend Radio Top et Tele Top, a été victime d'une cyberattaque par un Trojan qui a infecté et chiffré plusieurs serveurs, entraînant des perturbations dans l'offre de médias en ligne, radio et télévision. L'attaque a commencé le 21 mai 2024 et les équipes techniques travaillent avec des experts externes pour évaluer l'ampleur de l'attaque et restaurer les données et les programmes affectés. La direction de Radio Top a déclaré que l'attaque était massive et que les Top-Medien étaient sous pression.",
        "title": "Trojaner legt Teile von Top-Medien lahm | IT-Markt",
        "url": "https://www.it-markt.ch/news/2024-05-22/trojaner-legt-teile-von-top-medien-lahm",
        "added": "2024-05-23"
    },
    {
        "date": "2024-05-21",
        "victim": "Le Cup (Centre Unique de Programmation)",
        "domain": "asur.marche.it",
        "country": "ITA",
        "summary": "Le système de prise de rendez-vous en ligne du Cup (Centre Unique de Programmation) a été victime d'une cyberattaque ou d'une infiltration, rendant impossible la prise de rendez-vous. Les responsables travaillent à résoudre le problème. Aucun autre détail n'a été fourni sur l'incident.",
        "title": "Prenotare una visita è impossibile, Il Cup è andato in tilt: attacco informatico o infiltrazioni. \"Stiamo rimediando\" - Laprovinciadifermo.com",
        "url": "https://www.laprovinciadifermo.com/prenotare-una-visita-e-impossibile-il-cup-e-andato-in-tilt-attacco-informatico-o-infiltrazioni-stiamo-rimediando/",
        "added": "2024-05-23"
    },
    {
        "date": "2024-05-20",
        "victim": "Hong Kong Institute of Contemporary Culture Lee Shau Kee School of Creativity",
        "domain": "creativehk.edu.hk",
        "country": "HKG",
        "summary": "Un établissement scolaire de Hong Kong, le Hong Kong Institute of Contemporary Culture Lee Shau Kee School of Creativity, a été victime d'une cyberattaque par ransomware, entraînant la fuite de données personnelles de plus de 600 personnes. Les hackers ont encrypté 8 To de données, notamment des informations sur les étudiants, les enseignants et les locataires de l'école. Cet incident s'inscrit dans une série d'attaques informatiques ciblant des institutions de Hong Kong, notamment des écoles, des hôpitaux et des parcs technologiques.",
        "title": "Over 600 people's personal data stolen after school server hacked",
        "url": "https://hongkongfp.com/2024/05/21/over-600-peoples-personal-data-stolen-after-school-server-hacked-in-latest-cyberattack-on-local-entities/",
        "added": "2024-05-23"
    },
    {
        "date": "2024-05-19",
        "victim": "Malheur County",
        "domain": "mahleurco.org",
        "country": "USA",
        "summary": "Le comté de Malheur a évité une grave atteinte à sa sécurité en ligne grâce à une intervention rapide de son équipe d'information, qui a détecté et contrecarré une tentative de piratage informatique le 19 mai. L'attaque a été détectée tôt dimanche matin et les systèmes ont été sécurisés dans les 20 minutes suivantes, évitant ainsi la perte de données et la perturbation des élections. L'enquête est en cours pour déterminer les motivations des pirates et le comté travaille à renforcer sa sécurité en ligne avec l'aide de la société de cybersécurité ProJen.",
        "title": "Malheur County dodges online breach attempt - Malheur Enterprise",
        "url": "https://www.malheurenterprise.com/2024/05/29/malheur-county-dodges-online-breach-attempt/",
        "added": "2024-05-29"
    },
    {
        "date": "2024-05-17",
        "victim": "AddComm",
        "domain": "addComm.nl",
        "country": "NLD",
        "summary": "AddComm, une entreprise de services de santé, a été victime d'une cyberattaque par ransomware, ce qui a entraîné la fuite de données sensibles, notamment des numéros de sécurité sociale (BSN). Les utilisateurs s'inquiètent de la sécurité de leurs données et critiquent la manière dont les autorités ont géré des affaires similaires dans le passé. Les données volées pourraient être utilisées pour commettre des fraudes, notamment dans le domaine des assurances.",
        "title": "AddComm getroffen door ransomware, leverde aanslagen van waterschapsbelasting - Computer - Nieuws - Tweakers",
        "url": "https://tweakers.net/nieuws/222286/addcomm-getroffen-door-ransomware-leverde-aanslagen-van-waterschapsbelasting.html",
        "added": "2024-05-23"
    },
    {
        "date": "2024-05-16",
        "victim": "American Radio Relay League (ARRL)",
        "domain": "arrl.org",
        "country": "USA",
        "summary": "L'American Radio Relay League (ARRL), l'association nationale de radio amateur aux États-Unis, a confirmé avoir été victime d'une cyberattaque qui a affecté ses systèmes et services, notamment sa base de données \"Logbook of The World\". L'attaque a compromis des informations sensibles telles que des adresses et des numéros de téléphone, mais pas de numéros de sécurité sociale ou d'informations de carte de crédit. Cette cyberattaque s'inscrit dans un contexte de nombreuses attaques contre des infrastructures critiques, notamment dans le secteur de la santé.",
        "title": "American Radio Relay League Confirms Cyberattack Disrupted Operations | Tech Times",
        "url": "https://www.techtimes.com/articles/304782/20240519/american-radio-relay-league-confirms-cyberattack-disrupting-operations.htm",
        "added": "2024-05-20"
    },
    {
        "date": "2024-05-15",
        "victim": "Central Contra Costa Transit Authority (County Connection)",
        "domain": "ccta.net",
        "country": "USA",
        "summary": "La Central Contra Costa Transit Authority, un opérateur de bus et de paratransit en Californie, a subi une cyberattaque, ce qui a permis à un acteur non autorisé d'accéder à des fichiers et des données stockés dans son réseau. L'enquête est en cours pour déterminer quels sont les données précises qui ont été compromises, mais il n'y a pas encore de preuve que des informations financières ou des numéros de sécurité sociale aient été volées. L'opérateur de bus prend des mesures pour sécuriser son réseau et prévoit de notifier les individus affectés une fois que l'enquête sera terminée.",
        "title": "Central Contra Costa Transit Authority experiences cyber security data breach | KRON4",
        "url": "https://www.kron4.com/news/bay-area/contra-costa-transit-authority-experiences-cyber-security-data-breach/",
        "added": "2024-05-20"
    },
    {
        "date": "2024-05-15",
        "victim": "Le Collège Ahuntsic",
        "domain": "collegeahuntsic.qc.ca",
        "country": "CAN",
        "summary": "Le Collège Ahuntsic à Montréal a fermé ses portes le 16 mai en raison d'une potentielle cyberattaque, entraînant l'annulation de toutes les activités d'enseignement et de formation continue. Les étudiants et employés ont été invités à ne pas utiliser les ordinateurs du collège pendant l'enquête. Le collège a annoncé qu'il devrait reprendre ses activités le 17 mai, mais sans services tels que la bibliothèque et la cafétéria.",
        "title": "Une potentielle cyberattaque provoque la fermeture du Collège Ahuntsic | TVA Nouvelles",
        "url": "https://www.tvanouvelles.ca/2024/05/16/une-potentielle-cyberattaque-provoque-la-fermeture-du-college-ahuntsic",
        "added": "2024-05-20"
    },
    {
        "date": "2024-05-15",
        "victim": "Ranzijn",
        "domain": "ranzijn.nl",
        "country": "NLD",
        "summary": "La chaîne de cliniques vétérinaires Ranzijn aux Pays-Bas a été victime d'une cyberattaque, entraînant le vol de données sur les animaux et leurs propriétaires. La société avertit ses clients de faire preuve de vigilance face à d'éventuels e-mails de phishing qui pourraient être envoyés en son nom. Les détails de l'incident ne sont pas encore précisés, mais la société prend des mesures pour protéger les données de ses clients.",
        "title": "Dierenartspraktijk Ranzijn slachtoffer van cyberaanval: gegevens van dieren en baasjes gestolen | West Betuwe | AD.nl",
        "url": "https://www.ad.nl/west-betuwe/dierenartspraktijk-ranzijn-slachtoffer-van-cyberaanval-gegevens-van-dieren-en-baasjes-gestolen~a6bc2e82/",
        "added": "2024-05-20"
    },
    {
        "date": "2024-05-15",
        "victim": "Rockford Public Schools",
        "domain": "rockfordschools.org",
        "country": "USA",
        "summary": "Le district scolaire de Rockford, dans le Michigan, a été victime d'une cyberattaque par ransomware, ce qui a entraîné la fermeture de son réseau informatique et de ses téléphones. Les autorités scolaires ont pris des mesures pour protéger les données et ont contacté le FBI pour enquêter sur l'incident. Les cours continuent normalement, mais sans accès à la technologie, les élèves et les enseignants doivent utiliser des méthodes plus traditionnelles.",
        "title": "Rockford Public Schools ransomware update | wzzm13.com",
        "url": "https://www.wzzm13.com/article/news/local/rockford-public-schools-ransomware-attack/69-b80e015e-2310-43aa-859b-b17f1678e591",
        "added": "2024-05-16"
    },
    {
        "date": "2024-05-15",
        "victim": "MediSecure",
        "domain": "medisecure.com.au",
        "country": "AUS",
        "summary": "Voici le résumé de l'article :\n\nLa police fédérale australienne enquête sur une cyberattaque par ransomware contre une entreprise de soins de santé, MediSecure, qui a entraîné une violation de données. Le gouvernement australien a mis en place une réponse coordonnée pour gérer l'incident, avec la ministre de la Cybersécurité Clare O'Neil qui appelle à ne pas spéculer sur l'entreprise touchée. L'incident soulève des inquiétudes quant à la vulnérabilité du secteur des soins de santé face aux attaques cybercriminelles.",
        "title": "Data breach: Healthcare ransomware attack at MediSecure investigated by Australian Federal Police",
        "url": "https://www.smh.com.au/technology/police-investigate-large-scale-healthcare-data-breach-20240516-p5je66.html",
        "added": "2024-05-16"
    },
    {
        "date": "2024-05-13",
        "victim": "First Nations Health Authority (FNHA)",
        "domain": "fnha.ca",
        "country": "CAN",
        "summary": "La First Nations Health Authority (FNHA) de la Colombie-Britannique a été victime d'une cyberattaque qui a compromis des informations personnelles d'employés et d'autres personnes. L'incident a été détecté le 13 mai et des mesures ont été prises pour bloquer l'accès non autorisé et prévenir d'autres activités illicites. L'enquête est en cours et les autorités compétentes ont été notifiées, mais aucune information clinique n'a été compromise.",
        "title": "Cyberattack hits B.C.'s First Nations Health Authority | CTV News",
        "url": "https://bc.ctvnews.ca/b-c-s-first-nations-health-authority-hit-by-cyberattack-1.6897203",
        "added": "2024-05-23"
    },
    {
        "date": "2024-05-13",
        "victim": "L'aéroport et l'école de commerce de Pau",
        "domain": "pau.aeroport.fr",
        "country": "FRA",
        "summary": "L'aéroport et l'école de commerce de Pau ont été victimes d'une cyberattaque, entraînant des perturbations dans leurs activités. Les détails de l'attaque et de ses conséquences ne sont pas encore précisés. Les enquêtes sont en cours pour déterminer l'origine et les motivations de cette attaque.",
        "title": "L'aéroport et l'école de commerce de Pau victimes d'une cyberattaque - France Bleu",
        "url": "https://www.francebleu.fr/infos/faits-divers-justice/l-aeroport-et-l-ecole-de-commerce-de-pau-victimes-d-une-cyberattaque-6303207",
        "added": "2024-05-16"
    },
    {
        "date": "2024-05-13",
        "victim": "Universidad Complutense de Madrid",
        "domain": "ucm.es",
        "country": "ESP",
        "summary": "La Universidad Complutense de Madrid a été victime d'une cyberattaque ciblant l'application gérant les stages en entreprise, ce qui a pu exposer les données des étudiants. L'incident a touché l'un des systèmes de l'université, mettant en danger la confidentialité des informations des élèves. Les détails de l'attaque et de l'ampleur de la fuite de données ne sont pas encore connus.",
        "title": "La Universidad Complutense de Madrid sufre un ciberataque en la aplicación que gestiona prácticas de empresa que \"ha podido exponer\" datos de alumnos - El Correo de Pozuelo",
        "url": "https://elcorreodepozuelo.com/2024/05/13/la-universidad-complutense-de-madrid-sufre-un-ciberataque-en-la-aplicacion-que-gestiona-practicas-de-empresa-que-ha-podido-exponer-datos-de-alumnos/",
        "added": "2024-05-15"
    },
    {
        "date": "2024-05-12",
        "victim": "Union Township School District",
        "domain": "utsd.org",
        "country": "USA",
        "summary": "Le district scolaire d'Union Township a été victime d'une cyberattaque qui a entraîné une perturbation du réseau. Les détails de l'incident ne sont pas encore disponibles. L'enquête est en cours pour déterminer l'ampleur de l'attaque et les mesures à prendre pour rétablir la sécurité du réseau.",
        "title": "Union Township School District Cyberattack Causes Network Disruption: Details Inside",
        "url": "https://nj1015.com/hackers-hit-another-new-jersey-school-district/",
        "added": "2024-05-15"
    },
    {
        "date": "2024-05-12",
        "victim": "Travelite Holdings Ltd.",
        "domain": "etravelite.com",
        "country": "SGP",
        "summary": "La société Travelite Holdings Ltd. a été victime d'une cyberattaque par ransomware, qui a compromis des informations sensibles sur ses serveurs IT, notamment des données sur l'entreprise, les employés et les clients. L'entreprise travaille avec des experts en IT et des avocats pour résoudre le problème et a négocié un paiement de rançon potentiel de 250 000 dollars américains. Les autorités compétentes, notamment la police et la Commission de protection des données personnelles de Singapour, ont été informées de l'incident.",
        "title": "Travelite Holdings Hit by Major Cyberattack - TipRanks.com",
        "url": "https://www.tipranks.com/news/company-announcements/travelite-holdings-hit-by-major-cyberattack",
        "added": "2024-05-15"
    },
    {
        "date": "2024-05-12",
        "victim": "Christie's",
        "domain": "christies.com",
        "country": "CHE",
        "summary": "La maison de vente aux enchères Christie's a reporté une vente de montres rares à Genève en raison d'un \"problème de sécurité technique\". La vente, qui devait avoir lieu lundi, a été reportée au mardi suivant. Les détails sur la nature du problème de sécurité ne sont pas précisés, mais la maison de vente aux enchères a déclaré avoir mis son site web hors ligne.",
        "title": "Christie's stelt horlogeveiling uit om 'beveiligingsprobleem'",
        "url": "https://www.welingelichtekringen.nl/economie/christies-stelt-horlogeveiling-uit-om-beveiligingsprobleem",
        "added": "2024-05-15"
    },
    {
        "date": "2024-05-11",
        "victim": "Wehrle-Werk AG",
        "domain": "wehrle-werk.de",
        "country": "DEU",
        "summary": "L'entreprise allemande Wehrle-Werk AG, basée à Emmendingen, a été victime d'une cyberattaque le 11 mai dernier. Depuis, la production et la communication de l'entreprise fonctionnent de manière limitée. Les équipes travaillent actuellement à restaurer les systèmes pour rétablir les activités normales.",
        "title": "Cyberattacke auf Wehrle-Werk AG - Emmendingen - Badische Zeitung",
        "url": "https://www.badische-zeitung.de/cyberattacke-auf-wehrle-werk-ag",
        "added": "2024-05-23"
    },
    {
        "date": "2024-05-08",
        "victim": "Ascension Health",
        "domain": "ascension.org",
        "country": "USA",
        "summary": "Ascension Health, une entreprise de soins de santé, enquête sur une cyberattaque qui a affecté certains systèmes de son réseau technologique. L'accès à certains systèmes a été interrompu, mais la société a mis en place des procédures pour garantir que les soins aux patients continuent de manière sécurisée et avec un impact minimal. Si des informations sensibles sont compromises, les personnes concernées seront notifiées.",
        "title": "Ascension Health investigates cyber security issue, assures minimal patient impact",
        "url": "https://fox11online.com/news/local/ascension-health-investigates-cyber-security-issue-assures-minimal-patient-impact-st-elizabeth-appleton-calumet-chilton-mercy-oshkosh-activity-information",
        "added": "2024-05-09"
    },
    {
        "date": "2024-05-07",
        "victim": "Mālama I Ke Ola Health Center",
        "domain": "ccmaui.org",
        "country": "USA",
        "summary": "Le centre de santé Mālama I Ke Ola a subi une atteinte à la sécurité informatique qui a perturbé certaines de ses opérations. Les équipes travaillent actuellement pour restaurer les systèmes et identifier les données potentiellement compromises. Les patients peuvent continuer à recevoir des soins de santé de base au centre de santé, mais certaines activités électroniques sont actuellement indisponibles.",
        "title": "Aloha Patients & Community",
        "url": "https://www.ccmaui.org",
        "added": "2024-05-28"
    },
    {
        "date": "2024-05-06",
        "victim": "Trego County Lemke Memorial Hospital",
        "domain": "tclmh.org",
        "country": "USA",
        "summary": "Un hôpital du nord-ouest du Kansas a été victime d'une cyberattaque. L'article ne fournit pas de détails sur la nature de l'attaque ou les données compromises. Aucune autre information n'est disponible sur l'incident.",
        "title": "Northwest Kansas hospital hit by cyberattack | 101.3 KFDI",
        "url": "https://www.kfdi.com/2024/05/22/northwest-kansas-hospital-hit-by-cyberattack/",
        "added": "2024-05-23"
    },
    {
        "date": "2024-05-06",
        "victim": "Key Tronic Corporation",
        "domain": "keytronic.com",
        "country": "USA",
        "summary": "Key Tronic Corporation a détecté un accès non autorisé à certaines parties de ses systèmes informatiques le 6 mai 2024. La société a activé ses procédures d'incident cybernétique pour enquêter et contenir l'attaque, en collaborant avec des experts externes en cybersécurité et en informant les autorités. L'incident a entraîné des perturbations et des limitations d'accès à certaines applications commerciales de la société, mais elle estime que l'activité non autorisée a été contenue et travaille à rétablir les systèmes affectés. À ce jour, la société ne pense pas que l'incident aura un impact matériel sur ses activités ou ses résultats financiers.",
        "title": "FORM 8-K",
        "url": "https://www.sec.gov/Archives/edgar/data/719733/000071973324000015/ktcc-20240506.htm",
        "added": "2024-05-09"
    },
    {
        "date": "2024-05-06",
        "victim": "DocGo",
        "domain": "docgo.com",
        "country": "USA",
        "summary": "La société de soins de santé mobile DocGo a été victime d'une cyberattaque, au cours de laquelle des données de santé protégées ont été volées à partir d'un nombre limité de dossiers de santé. L'entreprise a pris des mesures pour contenir l'incident et a engagé des experts en cybersécurité pour enquêter. Les données compromises concernent uniquement l'activité de transport d'ambulances aux États-Unis et DocGo est en train de contacter les individus affectés.",
        "title": "DocGo discloses cyberattack after hackers steal patient health data",
        "url": "https://www.bleepingcomputer.com/news/security/docgo-discloses-cyberattack-after-hackers-steal-patient-health-data/",
        "added": "2024-05-08"
    },
    {
        "date": "2024-05-05",
        "victim": "Palomar Health",
        "domain": "palomarhealth.org",
        "country": "USA",
        "summary": "Le groupe médical Palomar Health a été victime d'une cyberattaque, ce qui a entraîné des problèmes pour les patients qui ne peuvent pas récupérer leurs ordonnances et ont des difficultés à accéder à leurs dossiers médicaux. L'entreprise a déclaré que 80% de ses opérations devraient être restaurées dans une semaine. Les attaques de ransomware contre les hôpitaux ont augmenté de 300% et sont souvent liées à des hackers russes, selon un expert en cybersécurité.",
        "title": "Suspected cyberattack creating headaches for patients of Palomar Health",
        "url": "https://www.10news.com/news/local-news/suspected-cyberattack-creating-headaches-for-patients-of-palomar-health-medical-group",
        "added": "2024-05-29"
    },
    {
        "date": "2024-05-05",
        "victim": "Concord Public Schools et Concord-Carlisle Regional School District",
        "domain": "concordps.org",
        "country": "USA",
        "summary": "Les écoles publiques de Concord et le district scolaire régional de Concord-Carlisle ont été victimes d'une cyberattaque, qui a entraîné une demande de rançon et a affecté les ordinateurs personnels. Les équipes de sécurité travaillent pour restaurer les systèmes et contenir l'attaque, tandis que les cafétérias des écoles prendront des espèces pour les snacks en raison de la perturbation. L'enquête est en cours pour déterminer si des données sensibles ont été compromises.",
        "title": "Report: Concord schools hit with cyber attack",
        "url": "https://www.bostonglobe.com/2024/05/07/metro/report-concord-schools-hit-with-cyber-attack/",
        "added": "2024-05-08"
    },
    {
        "date": "2024-05-05",
        "victim": "Université de Sienne",
        "domain": "unisi.it",
        "country": "ITA",
        "summary": "L'Université de Sienne a été victime d'une cyberattaque par un groupe de hackers internationaux, nécessitant la fermeture de son réseau pour vérifier et nettoyer l'infrastructure. Les responsables informatiques de l'université ont informé l'Agence nationale de cybersécurité et préparent une plainte à la police postale et à l'autorité de protection des données personnelles. Le réseau de l'université sera restauré progressivement une fois que les conditions de sécurité seront garanties.",
        "title": "Rete dell’Università di Siena colpita da attacco hacker",
        "url": "https://sienafree.it/157720-infrastruttura-di-rete-delluniversita-di-siena-colpita-da-attacco-hacker",
        "added": "2024-05-06"
    },
    {
        "date": "2024-05-05",
        "victim": "Wichita",
        "domain": "wichita.gov",
        "country": "USA",
        "summary": "Wichita a fermé son réseau informatique à la suite d'une attaque par logiciel malveillant. Certains services sont temporairement indisponibles. Des spécialistes externes aident à restaurer le réseau, sans échéance précise. Les services d'urgence fonctionnent, mais les paiements en ligne sont suspendus.",
        "title": "Wichita reports cyberattack on city computer network | 101.3 KFDI",
        "url": "https://www.kfdi.com/2024/05/05/wichita-reports-cyberattack-on-city-computer-network/",
        "added": "2024-05-06"
    },
    {
        "date": "2024-05-04",
        "victim": "Regional Cancer Center (RCC)",
        "domain": "rcctvm.gov.in",
        "country": "IND",
        "summary": "Une cyberattaque provenant de l'étranger a interrompu les traitements de radiothérapie au Regional Cancer Center (RCC) en Inde, affectant 14 serveurs dont 11 ont été récupérés, avec une reprise des traitements prévue pour la semaine prochaine. Les autorités envisagent de porter des accusations de terrorisme contre les auteurs de l'attaque, similairement à une affaire précédente impliquant des hackers chinois qui avaient attaqué l'AIIMS de Delhi en 2022.",
        "title": "Radiation treatment within one week: Cyber ​​attack on RCC from abroad; charges of terrorism to be charged against accused - KERALA - GENERAL | Kerala Kaumudi Online",
        "url": "https://keralakaumudi.com/en/news/news.php?id=1298702&u=radiation-treatment-within-one-week-cyber-%E2%80%8B%E2%80%8Battack-on-rcc-from-abroad-charges-of-terrorism-to%C2%A0be-charged%C2%A0against-accused",
        "added": "2024-05-04"
    },
    {
        "date": "2024-05-03",
        "victim": "Coradix-Magnescan",
        "domain": "radiologie-perpignan.fr",
        "country": "FRA",
        "summary": "Le groupe de radiologie médicale Coradix-Magnescan a été victime d'une cyberattaque qui a touché plusieurs de ses sites d'imagerie médicale dans les Pyrénées-Orientales. Les autorités compétentes ont été informées et une enquête est en cours pour découvrir l'origine de l'attaque, mais pour l'instant, aucune violation de données n'a été détectée. Les équipes des centres d'imagerie travaillent pour assurer la réalisation des examens dans les meilleures conditions possibles malgré un mode de fonctionnement dégradé.",
        "title": "Pyrénées-Orientales : plusieurs sites d’imagerie médicale victimes d’une cyberattaque - lindependant.fr",
        "url": "https://www.lindependant.fr/2024/05/07/pyrenees-orientales-de-nombreux-sites-dimagerie-medicale-victimes-dune-cyberattaque-11936827.php",
        "added": "2024-05-07"
    },
    {
        "date": "2024-05-03",
        "victim": "Cégep de Lanaudière",
        "domain": "cegep-lanaudiere.qc.ca",
        "country": "CAN",
        "summary": "Le Cégep de Lanaudière a été victime d'une cyberattaque vendredi, ce qui a entraîné la fermeture des trois établissements scolaires aujourd'hui et demain. L'enquête est en cours avec une firme de cybersécurité et des experts surveillent le \"Dark Web\" pour détecter d'éventuelles fuites de données. Un plan d'action a été mis en place pour remettre en fonction les serveurs et une communication sera envoyée mardi pour dévoiler la marche à suivre.",
        "title": "Les trois constituantes du Cégep de Lanaudière victimes d’une cyberattaque",
        "url": "https://monjoliette.com/les-trois-constituantes-du-cegep-de-lanaudiere-victimes-dune-cyberattaque/",
        "added": "2024-05-06"
    },
    {
        "date": "2024-05-03",
        "victim": "Eucatex (EUCA4)",
        "domain": "eucatex.com.br",
        "country": "BRA",
        "summary": "Eucatex (EUCA4) a été victime d'une cyberattaque, entraînant la paralysie de son système ERP et de messagerie électronique. Les bases de données sont restées intactes, et la société assure qu'aucune perte ni fuite de données n'a été constatée. Le problème a été résolu, et les systèmes sont en cours de rétablissement, avec une normalisation attendue dans les prochaines heures.",
        "title": "Eucatex (EUCA4) comunica ataque cibernético e diz não haver evidências de perdas e vazamentos - SpaceMoney",
        "url": "https://www.spacemoney.com.br/investimentos/acoes/eucatex-euca4-comunica-ataque-cibernetico/207434/",
        "added": "2024-05-03"
    },
    {
        "date": "2024-05-02",
        "victim": "Ewing Marion Kauffman School",
        "domain": "kauffmanschool.org",
        "country": "USA",
        "summary": "L'école Ewing Marion Kauffman School à Kansas City a été victime d'une cyberattaque par ransomware en mai, ce qui a entraîné la fermeture de l'école pendant un jour. Les informations volées ont été publiées en ligne, ce qui a suscité des inquiétudes quant à la sécurité des données des élèves. L'école travaille avec les forces de l'ordre et des experts en cybersécurité pour enquêter sur l'incident et notifier les personnes concernées.",
        "title": "Ewing Marion Kauffman School latest victim of cyberattack",
        "url": "https://fox4kc.com/news/kansas-city-charter-school-latest-cyberattack-victim/",
        "added": "2024-05-20"
    },
    {
        "date": "2024-05-02",
        "victim": "Umeå universitet",
        "domain": "umu.se",
        "country": "SWE",
        "summary": "L'ITS, l'unité de support informatique et de développement des systèmes de l'Université d'Umeå, a découvert la cyberattaque à 08h30 le 2 mai. Des efforts immédiats et étendus de dépannage ont été entrepris, ainsi que d'autres mesures pour stopper l'attaque, en collaboration avec des spécialistes externes.",
        "title": "Umeå universitet utsatt för omfattande cyberattack",
        "url": "https://www.umu.se/nyheter/umea-universitet-utsatt-for-omfattande-cyberattack_11935138/",
        "added": "2024-05-02"
    },
    {
        "date": "2024-05-01",
        "victim": "Brandywine Realty Trust",
        "domain": "brandywinerealty.com",
        "country": "USA",
        "summary": "La société Brandywine Realty Trust a subi une violation de données, où un tiers non autorisé a accédé à certaines parties de son réseau interne, ce qui a perturbé certaines de ses opérations internes. L'entreprise a pris des mesures pour contenir l'incident et évalue actuellement l'ampleur de la violation, mais elle n'a pas encore déterminé si des informations personnelles ont été compromises. L'enquête est en cours, mais aucun groupe ou individu n'a revendiqué la responsabilité de l'attaque.",
        "title": "Operations Disrupted After Brandywine Realty Trust Data Breach",
        "url": "https://thecyberexpress.com/brandywine-realty-trust-data-breach-confirmed/",
        "added": "2024-05-08"
    },
    {
        "date": "2024-04-30",
        "victim": "CentroMed",
        "domain": "centromedsa.com",
        "country": "USA",
        "summary": "Le réseau informatique de CentroMed, un fournisseur de soins de santé basé à San Antonio, a été piraté, entraînant l'accès non autorisé à des informations personnelles de patients, notamment des noms, adresses, dates de naissance, numéros de sécurité sociale et informations financières. L'enquête a révélé que les hackers ont accédé aux systèmes de CentroMed le 30 avril 2024. CentroMed a commencé à notifier les patients concernés et a mis en place des mesures de sécurité supplémentaires pour prévenir de telles attaques à l'avenir.",
        "title": "CentroMed computer network hacked, patients personal information ‘acquired,’ investigation reveals",
        "url": "https://www.ksat.com/news/local/2024/05/17/centromed-computer-network-hacked-patients-personal-information-acquired-investigation-reveals/",
        "added": "2024-05-20"
    },
    {
        "date": "2024-04-30",
        "victim": "City of Helsinki",
        "domain": "hel.fi",
        "country": "FIN",
        "summary": "La ville d'Helsinki a subi une violation de données qui a affecté des dizaines de milliers d'étudiants, de tuteurs et de personnels, exposant des informations personnelles et confidentielles. L'enquête est en cours pour déterminer l'étendue et l'impact de l'incident, qui a été causé par l'exploitation d'une vulnérabilité non corrigée dans le réseau de la Division de l'éducation. La ville a déjà mis en place des mesures de sécurité pour prévenir de nouvelles attaques.",
        "title": "City of Helsinki suffered a data breach",
        "url": "https://securityaffairs.com/163088/data-breach/city-of-helsinki-data-breach.html",
        "added": "2024-05-15"
    },
    {
        "date": "2024-04-30",
        "victim": "Université de Guyane",
        "domain": "univ-guyane.fr",
        "country": "GUF",
        "summary": "L'Université de Guyane a été victime d'une cyberattaque qui a entraîné le chiffrement et la suppression de certains fichiers, ainsi que la destruction du site web de la faculté. Les hackers réclament une rançon en échange de la restitution des données, mais la direction refuse de payer. Une enquête est en cours pour déterminer l'origine de l'attaque et évaluer les dégâts.",
        "title": "L'Université de Guyane victime d'une cyberattaque",
        "url": "https://www.franceguyane.fr/actualite/education-sante-environnement/luniversite-de-guyane-victime-dune-cyberattaque-986312.php",
        "added": "2024-05-07"
    },
    {
        "date": "2024-04-30",
        "victim": "Mineola Union Free School District",
        "domain": "mineola.k12.ny.us",
        "country": "USA",
        "summary": "Les responsables scolaires ont confirmé qu'une cyberattaque a eu lieu au sein du district scolaire de Mineola Union Free, entraînant une panne d'internet et de téléphone. Un message envoyé aux parents a révélé que la cause de cette panne était due à une cyberattaque, et que des mesures étaient prises avec le fournisseur de sécurité pour rétablir le service. Le district prévoit de rétablir l'accès à internet et au téléphone d'ici mercredi soir, à temps pour la reprise des cours le jeudi.",
        "title": "School officials: Cyberattack causes internet, phone outage at Mineola Public Schools",
        "url": "https://longisland.news12.com/school-officials-cyberattack-causes-internet-phone-outage-at-mineola-public-schools",
        "added": "2024-05-02"
    },
    {
        "date": "2024-04-29",
        "victim": "Universidad de las Américas de Puebla (UDLAP)",
        "domain": "udlap.mx",
        "country": "MEX",
        "summary": "La Universidad de las Américas de Puebla (UDLAP) a subi une cyberattaque qui a perturbé ses services internet et ses plateformes technologiques. La situation a été contenue, identifiée et atténuée grâce aux systèmes de défense de l'université, avec l'aide des partenaires en cybersécurité Dell et Palo Alto. Les services sont en cours de restauration, notamment la plateforme Blackboard qui est déjà opérationnelle, bien que l'accès nécessite un lien spécifique temporaire.",
        "title": "Alerta en la UDLAP: Sufre ataque cibernético",
        "url": "https://www.diariocambio.com.mx/2024/educacion/alerta-en-la-udlap-sufre-ataque-cibernetico/",
        "added": "2024-05-01"
    },
    {
        "date": "2024-04-28",
        "victim": "Firstmac",
        "domain": "firstmac.com.au",
        "country": "AUS",
        "summary": "La société Firstmac, un prêteur australien, a été victime d'une cyberattaque par le groupe de ransomware EMBARGO, qui a volé plus de 500 Go de données, notamment des bases de données, des codes sources et des informations sensibles sur les clients. L'entreprise a engagé des experts pour enquêter sur l'incident et a pris des mesures pour sécuriser son système. Cet incident fait partie d'une série d'attaques ciblant les institutions financières australiennes, ce qui a conduit le gouvernement et l'industrie à renforcer leurs défenses contre les cybermenaces.",
        "title": "Firstmac hacked by ransomware gang - Mortgage Business",
        "url": "https://www.mortgagebusiness.com.au/lender/19018-non-bank-lender-hacked",
        "added": "2024-05-09"
    },
    {
        "date": "2024-04-28",
        "victim": "London Drugs",
        "domain": "londondrugs.com",
        "country": "CAN",
        "summary": "London Drugs, une chaîne de magasins de détail et de pharmacie opérant près de 80 magasins à travers la Colombie-Britannique, l'Alberta, la Saskatchewan et le Manitoba, a fermé ses portes jusqu'à nouvel ordre à la suite d'une cyberattaque survenue le dimanche 28 avril 2024. La société a pris cette mesure par précaution et a affirmé n'avoir aucune raison de croire que les données des clients ou des employés ont été affectées, tout en engageant des experts tiers pour contenir et enquêter sur l'incident. Malgré la fermeture des magasins, le personnel de pharmacie reste sur place pour répondre aux besoins urgents des clients.",
        "title": "London Drugs closes stores until further notice due to cyberattack",
        "url": "https://www.cbc.ca/lite/story/1.7187615",
        "added": "2024-05-01"
    },
    {
        "date": "2024-04-27",
        "victim": "La Superintendencia del Subsidio Familiar",
        "domain": "ssf.gov.co",
        "country": "COL",
        "summary": "La Superintendencia del Subsidio Familiar en Colombie a signalé des problèmes dans ses systèmes d'information depuis le samedi 27 avril, dus à une cyberattaque. La superintendente (e) Angie Katherine Monroy Bobadilla a confirmé qu'il s'agit d'une violation de la sécurité et de la privacité des données, et des mesures sont prises pour protéger les bases de données et éviter la divulgation d'informations sensibles. Des plaintes ont été déposées auprès des autorités compétentes et des efforts sont en cours en collaboration avec le ColCERT du Ministère TIC pour résoudre la situation et protéger les informations de l'entité.",
        "title": "Ataque cibernético afecta a la Superintendencia del Subsidio Familiar | RCN Radio",
        "url": "https://www.rcnradio.com/colombia/ataque-cibernetico-afecta-a-la-superintendencia-del-subsidio-familiar",
        "added": "2024-05-01"
    },
    {
        "date": "2024-04-26",
        "victim": "Hong Kong Arts Development Council",
        "domain": "hkadc.org.hk",
        "country": "HKG",
        "summary": "Le 26 avril, le système informatique du Hong Kong Arts Development Council a été victime d'une cyberattaque malveillante, affectant partiellement ses opérations. L'organisation a immédiatement activé un mécanisme de réponse d'urgence pour empêcher de nouvelles intrusions et a engagé des experts en cybersécurité pour enquêter et réparer le système, sans qu'aucune fuite de données, y compris celles des demandeurs de subventions, n'ait été détectée à ce stade. L'incident a été signalé à l'Office of the Privacy Commissioner for Personal Data et à la police de Hong Kong, ainsi qu'au Bureau des affaires culturelles, sportives et touristiques.",
        "title": "香港藝發局網絡遭攻擊 暫未發現有資料洩露 | am730",
        "url": "https://www.am730.com.hk/本地/香港藝發局網絡遭攻擊-暫未發現有資料洩露-/448793",
        "added": "2024-05-01"
    },
    {
        "date": "2024-04-25",
        "victim": "La Nación",
        "domain": "lanacion.com.ar",
        "country": "ARG",
        "summary": "Le journal La Nación de Buenos Aires a signalé une attaque informatique jeudi, déclenchant les protocoles de sécurité de l'équipe technologique. Une activité inhabituelle sur les serveurs a entraîné une perturbation des systèmes internes, nécessitant l'intervention d'une équipe de spécialistes en cybersécurité. Malgré des problèmes techniques, l'édition imprimée du journal du vendredi a été affectée, mais les mises à jour du site web et la diffusion de la chaîne LN+ se sont poursuivies normalement.",
        "title": "Le journal La Nación victime d'une cyberattaque - Nouvelles Du Monde",
        "url": "https://www.nouvelles-du-monde.com/le-journal-la-nacion-victime-dune-cyberattaque/",
        "added": "2024-05-01"
    },
    {
        "date": "2024-04-25",
        "victim": "Kansas City Scout",
        "domain": "kcscout.net",
        "country": "USA",
        "summary": "Un important service pour les conducteurs de la région de Kansas City est en panne générale jeudi en raison d'une cyberattaque. Kansas City Scout a déclaré que ses systèmes étaient hors service depuis tôt le matin, y compris son site web, son réseau de caméras de circulation et ses panneaux d'affichage dans la région. Le département des transports du Missouri a déclaré que les systèmes ont été mis hors ligne immédiatement pour limiter les dommages de l'attaque, dont la nature n'a pas été spécifiée. Il n'y a actuellement pas de calendrier pour la restauration, mais KC Scout indique que le personnel travaille pour y remédier dès que possible.",
        "title": "Kansas City Scout cyberattack: Traffic camera system down",
        "url": "https://fox4kc.com/news/kansas-city-scout-systems-down-following-cyberattack/",
        "added": "2024-04-26"
    },
    {
        "date": "2024-04-25",
        "victim": "Ville de Gravelines",
        "domain": "ville-gravelines.fr",
        "country": "FRA",
        "summary": "La ville de Gravelines a été ciblée par une cyberattaque, conduisant à la déconnexion de tous les serveurs et à la restriction de l'accès à internet pour les services municipaux, par mesure de précaution. À l'heure actuelle, l'origine de l'attaque n'a pas été identifiée. Malgré cela, la mairie et les services municipaux restent accessibles par téléphone, bien que certaines opérations ne soient temporairement plus réalisables.",
        "title": "La ville de Gravelines victime d’une cyberattaque, les services à la population restreints - La Voix du Nord",
        "url": "https://www.lavoixdunord.fr/1455837/article/2024-04-25/la-ville-de-gravelines-victime-d-une-cyberattaque-les-services-la-population",
        "added": "2024-04-25"
    },
    {
        "date": "2024-04-23",
        "victim": "Municipalité de La Guadeloupe",
        "domain": "munlaguadeloupe.qc.ca",
        "country": "CAN",
        "summary": "Les systèmes informatiques municipaux  ont été déconnectés et des experts en informatique et cybersécurité ont pris les choses en main. Les analystes spécialisés enquêtent sur l’incident et les impacts sur les données des serveurs informatiques.",
        "title": "Cyberattaque à la Municipalité de La Guadeloupe - L’Éclaireur Progrès",
        "url": "https://www.leclaireurprogres.ca/faits-divers/cyberattaque-a-la-municipalite-de-la-guadeloupe/",
        "added": "2024-04-27"
    },
    {
        "date": "2024-04-23",
        "victim": "Skanlog",
        "domain": "skanlog.com",
        "country": "SWE",
        "summary": "Un cyberattaque de type rançongiciel a été lancée contre Skanlog, un important distributeur pour Systembolaget en Suède, entraînant des problèmes de distribution et la possibilité que certains produits soient épuisés avant le week-end. La direction de Skanlog a confirmé que l'attaque a paralysé leur système jusqu'à ce qu'une solution soit trouvée pour le rétablir. En conséquence, Systembolaget, qui est affecté par cette perturbation, prévoit que cela pourrait impacter la disponibilité de certaines catégories de boissons, bien qu'il n'y ait pas de risque immédiat de voir toutes les étagères vides.",
        "title": "Hackerangrep kan gi tomme hyller hos Systembolaget - E24",
        "url": "https://e24.no/internasjonal-oekonomi/i/5EJxXE/hackerangrep-kan-gi-tomme-hyller-hos-systembolaget",
        "added": "2024-04-24"
    },
    {
        "date": "2024-04-22",
        "victim": "Ville d’Albi",
        "domain": "mairie-albi.fr",
        "country": "FRA",
        "summary": "La mairie d'Albi, dans le Tarn, subit une cyberattaque depuis le 22 avril 2024, entraînant l'inaccessibilité de ses numéros de téléphone, mails et services informatiques. Les services municipaux s'efforcent de rétablir le fonctionnement normal tout en assurant la continuité du service public. La nature et l'origine de l'attaque n'ont pas été révélées, mais une plainte a été déposée par la mairie auprès de la police.",
        "title": "Une cyberattaque en cours à la mairie d'Albi - France Bleu",
        "url": "https://www.francebleu.fr/infos/faits-divers-justice/une-cyber-attaque-en-cours-a-la-mairie-d-albi-6909499",
        "added": "2024-04-23"
    },
    {
        "date": "2024-04-20",
        "victim": "Petit commerce à Bad Wörishofen",
        "domain": "n/a",
        "country": "DEU",
        "summary": "Un petit commerce à Bad Wörishofen a été victime d'une cyberattaque le week-end dernier, entraînant des dommages estimés à environ 30 000 euros après que toutes les données sur le PC du propriétaire aient été cryptées par des pirates informatiques. Le propriétaire a immédiatement contacté la police locale, et les enquêtes sont désormais menées par le département spécialisé en cybercriminalité de la KPI Memmingen, avec l'aide d'un prestataire informatique externe.",
        "title": "Bad Wörishofen: Cyberangriff auf Gewerbebetrieb - Etwa 30.000 Euro Schaden",
        "url": "https://www.merkur.de/bayern/schwaben/mindelheim-kurier/bad-woerishofen-cyberangriff-auf-gewerbebetrieb-etwa-30-000-euro-schaden-93028864.html",
        "added": "2024-04-24"
    },
    {
        "date": "2024-04-20",
        "victim": "Coppel",
        "domain": "coppel.com",
        "country": "MEX",
        "summary": "La chaîne de magasins Coppel au Mexique a subi une cyberattaque qui a entraîné des dysfonctionnements dans plusieurs de ses systèmes informatiques, suspendant de nombreux services, y compris l'utilisation de ses applications. Coppel a confirmé l'incident de cybersécurité après une enquête approfondie et a renforcé ses mesures de sécurité, tout en précisant que ses magasins continuent de fonctionner normalement.",
        "title": "Coppel sufrió ataque cibernético y eliminan deudas",
        "url": "https://el-mexicano.com/nacional/coppel-sufrio-ataque-cibernetico-y-eliminan-deudas/2201651",
        "added": "2024-04-23"
    },
    {
        "date": "2024-04-20",
        "victim": "仁安醫院 (Union Hospital)",
        "domain": "union.org",
        "country": "HKG",
        "summary": "Le réseau du système de l'hôpital Union a été attaqué par des hackers, affectant partiellement ses opérations, mais jusqu'à présent, aucune fuite ou utilisation abusive des données des patients n'a été détectée. L'attaque a été identifiée comme une attaque de ransomware \"LockBit\", avec les hackers demandant une rançon de 10 millions de dollars américains, que l'hôpital n'a pas payée. Des experts suggèrent que l'attaque pourrait être due à des systèmes non mis à jour ou à des employés ouvrant des e-mails de phishing, soulignant l'importance de la mise à jour des systèmes et de la sensibilisation à la sécurité.",
        "title": "仁安醫院網絡遭黑客攻擊 稱未發現病人資料洩漏｜本地｜商業電台 881903",
        "url": "https://www.881903.com/news/local/2529350/仁安醫院網絡遭黑客攻擊-稱未發現病人資料洩漏",
        "added": "2024-04-20"
    },
    {
        "date": "2024-04-19",
        "victim": "Salamander",
        "domain": "salamander.de",
        "country": "DEU",
        "summary": "Le fabricant de chaussures Salamander a été victime d'une cyberattaque, entraînant la mise hors ligne de sa présence sur Internet et des perturbations dans ses plus de soixante magasins depuis le 19 avril. La société Klauser GmbH & Co KG, propriétaire de Salamander, a dû fermer ses systèmes informatiques mais a réussi à rétablir les processus commerciaux essentiels fin avril, bien que le site de vente en ligne reste inutilisable.",
        "title": "Cyberangriff: Salamander-Schuhe nach Attacke offline | heise online",
        "url": "https://www.heise.de/news/Schuhhaendler-Salamander-nach-Cyberattacke-offline-9707690.html",
        "added": "2024-05-03"
    },
    {
        "date": "2024-04-19",
        "victim": "Ordre des infirmières et infirmiers du Québec (OIIQ)",
        "domain": "oiiq.org",
        "country": "CAN",
        "summary": "L'Ordre des infirmières et infirmiers du Québec (OIIQ) a été victime d'une cyberattaque au rançongiciel, entraînant la publication en ligne de données personnelles sensibles de ses membres, incluant des informations telles que les coordonnées, numéros d'assurance sociale, et plus. Les cyberpirates ont exigé une rançon de 200 000 $ US pour ne pas divulguer ou supprimer les 112 gigaoctets de données volées. L'OIIQ mène une enquête approfondie pour sécuriser son environnement informatique, tandis que la plus grande organisation syndicale d’infirmières du Québec suit de près la situation, et le gouvernement semble inefficace face à l'augmentation des attaques par rançongiciel",
        "title": "Attaque au rançongiciel | Fuite de données sur les infirmières du Québec | La Presse",
        "url": "https://www.lapresse.ca/actualites/2024-04-23/attaque-au-rancongiciel/fuite-de-donnees-sur-les-infirmieres-du-quebec.php",
        "added": "2024-04-24"
    },
    {
        "date": "2024-04-19",
        "victim": "Swisspro",
        "domain": "swisspro.ch",
        "country": "CHE",
        "summary": "Les sociétés Swisspro, faisant partie de BKW Building Solutions, ont été touchées par une attaque par ransomware début avril, affectant leur ancien environnement informatique. Une taskforce a été mise en place pour évaluer l'impact et les conséquences possibles de l'attaque, tout en prenant des mesures immédiates comme l'isolement des systèmes affectés et le changement des mots de passe. Il n'y a pas eu d'indication d'attaques sortantes affectant les clients ou d'autres sociétés au sein de BKW, et Swisspro est capable de continuer à fournir ses services.",
        "title": "Le groupe Swisspro victime d'une attaque par ransomware | ICTjournal",
        "url": "https://www.ictjournal.ch/news/2024-04-22/le-groupe-swisspro-victime-dune-attaque-par-ransomware",
        "added": "2024-04-23"
    },
    {
        "date": "2024-04-18",
        "victim": "Carpetright",
        "domain": "carpetright.co.uk",
        "country": "GBR",
        "summary": "Carpetright, une chaîne britannique de vente de revêtements de sol, a été victime d'une cyberattaque par des hackers inconnus qui ont utilisé un logiciel malveillant pour accéder sans autorisation à son réseau. L'attaque a perturbé des centaines de commandes de clients et a forcé l'entreprise à mettre hors ligne son réseau au siège social à Purfleet, Essex, affectant également les lignes téléphoniques. La société a isolé le virus avant que des données ne soient dérobées et a informé que ni les données des clients ni celles des employés n'avaient été impactées, tout en poursuivant les investigations et la remise en état des systèmes.",
        "title": "Carpetright customers hit by cyber attack as firm struggles to fill orders after hackers target company HQ | The Sun",
        "url": "https://www.thesun.co.uk/money/27434828/carpetright-orders-disrupted-cyber-attack-hack/",
        "added": "2024-04-20"
    },
    {
        "date": "2024-04-18",
        "victim": "Floirac",
        "domain": "floirac.fr",
        "country": "FRA",
        "summary": "Depuis jeudi soir, les services municipaux de Floirac sont confrontés à une cyberattaque, entraînant une coupure d'accès à Internet et rendant les opérations numériques impossibles. La collectivité assure qu'aucune donnée n'a été volée ni aucun système endommagé, mais les services fonctionnent actuellement en mode dégradé. Les enquêtes pour déterminer l'origine de l'attaque se poursuivent, et la réouverture des démarches en ligne est attendue dans les prochaines heures.",
        "title": "Cyberattaque stoppée à Floirac : les services municipaux néanmoins privés d’Internet ce vendredi",
        "url": "https://www.sudouest.fr/gironde/floirac/cyberattaque-stoppee-a-floirac-les-services-municipaux-neanmoins-prives-d-internet-ce-vendredi-19397237.php",
        "added": "2024-04-20"
    },
    {
        "date": "2024-04-18",
        "victim": "Synlab",
        "domain": "synlab.it",
        "country": "ITA",
        "summary": "Synlab, un fournisseur de services médicaux opérant également à Brescia, a été ciblé par une cyberattaque qui a affecté ses systèmes informatiques sur tout le territoire italien, forçant l'entreprise à désactiver tous ses systèmes informatiques dans le pays. En conséquence, toutes les activités dans les points de prélèvement, les centres médicaux et les laboratoires en Italie sont suspendues jusqu'à nouvel ordre, y compris le téléchargement et le retrait des rapports médicaux. Synlab s'excuse pour les désagréments causés et informera ses clients et patients de l'évolution de la situation via ses réseaux sociaux, sans pouvoir préciser quand les opérations pourront reprendre.",
        "title": "Attacco hacker a Synlab, chiusi tutti gli ambulatori in Italia e servizi informatici ko | Giornale di Brescia",
        "url": "https://www.giornaledibrescia.it/cronaca/attacco-hacker-a-synlab-chiusi-tutti-gli-ambulatori-in-italia-e-servizi-informatici-ko-nb8oqg3e",
        "added": "2024-04-19"
    },
    {
        "date": "2024-04-17",
        "victim": "Barnett's Couriers",
        "domain": "barnetts.con.au",
        "country": "AUS",
        "summary": "La société Barnett's Couriers, basée à Wollongong, a été gravement affectée par une cyberattaque. Initialement, l'entreprise avait informé ses clients par e-mail qu'elle espérait reprendre ses opérations après le vendredi 19 avril. Cependant, un nouvel e-mail envoyé le lundi matin a révélé que l'entreprise prévoyait que ses systèmes resteraient hors service pendant encore une semaine.",
        "title": "Wollongong firm Barnett's Couriers left reeling from cyber attack | Illawarra Mercury | Wollongong, NSW",
        "url": "https://www.illawarramercury.com.au/story/8601158/wollongong-firm-barnetts-couriers-left-reeling-from-cyber-attack/",
        "added": "2024-04-23"
    },
    {
        "date": "2024-04-17",
        "victim": "Écoles du comté de Glynn",
        "domain": "glynn.k12.ga.us",
        "country": "USA",
        "summary": "Une cyberattaque contre l'infrastructure informatique des écoles du comté de Glynn mercredi a entraîné une coupure des connexions Internet dans tout le système, provoquant une panne qui a persisté jeudi et devrait durer jusqu'à vendredi. Aucune information sensible n'aurait été compromise selon un responsable scolaire. L'équipe informatique de l'école et un programme de surveillance tiers ont détecté une activité suspecte sur le réseau, ce qui a entraîné la coupure d'Internet pour prévenir toute intrusion.",
        "title": "School system hit by cyberattck, shuts down internet, programs | Local News | thebrunswicknews.com",
        "url": "https://thebrunswicknews.com/breaking/school-system-hit-by-cyberattack-shuts-down-internet-programs/article_8674a373-f472-56a3-a237-b88abd4cf357.html",
        "added": "2024-04-19"
    },
    {
        "date": "2024-04-17",
        "victim": "Legislative Bill Drafting Commission",
        "domain": "nyassembly.gov",
        "country": "USA",
        "summary": "Une cyberattaque a ciblé la Commission de rédaction des projets de loi de l'État de New York, perturbant la rédaction et la publication des projets de loi pour le plan de dépenses de l'année fiscale 2025 et causant un retard dans l'adoption du budget de l'État. Les détails de l'attaque, tels que son origine, les données compromises et l'étendue des dégâts, restaient flous, mais des efforts étaient en cours pour trouver des solutions temporaires et prévenir des retards significatifs dans le processus budgétaire.",
        "title": "Cyberattack on NY bill drafting commission causes delay in state budget passage | Globe Echo",
        "url": "https://globeecho.com/cyberattack-on-ny-bill-drafting-commission-causes-delay-in-state-budget-passage/",
        "added": "2024-04-18"
    },
    {
        "date": "2024-04-16",
        "victim": "Groupe Tea",
        "domain": "teaspa.it",
        "country": "ITA",
        "summary": "Le Comune di Mantova a été victime d'une cyberattaque le 16 avril 2024, qui a affecté certaines applications technologiques de l'entreprise Tea. Selon les enquêteurs, il n'y a pas eu de perte ou de suppression définitive de données personnelles, mais un groupe criminel a revendiqué l'exfiltration de certaines informations, notamment des données personnelles. Les investigations se poursuivent pour déterminer la nature et l'ampleur de la violation de la confidentialité des données personnelles traitées au nom et pour le compte du Comune di Mantova.",
        "title": "Comunicato del Comune di Mantova",
        "url": "https://www.comune.mantova.it/tutte-le-notizie/comunicati-stampa/4400-attacco-informatico-comunicato-del-comune-di-mantova",
        "added": "2024-05-11"
    },
    {
        "date": "2024-04-16",
        "victim": "Vooruit.brussels",
        "domain": "vooruit.brussels",
        "country": "BEL",
        "summary": "Hackers ont ont réalisé une cyberattaque sur le serveur de Vooruit.brussels, volant des données personnelles telles que les noms, adresses et numéros de téléphone des membres, avec une demande de rançon de 800 euros. Suzy Bleys, co-présidente de Vooruit.brussels, a signalé l'incident après que le site soit devenu inaccessible et que la bande criminelle ait contacté pour demander de l'argent en Bitcoin. Les autorités ont été informées et une enquête sur la fuite de données est en cours pour déterminer l'étendue des informations compromises.",
        "title": "Persoonsgegevens gelekt bij Vooruit.brussels: 'Hackers vragen 800 euro losgeld' | BRUZZ",
        "url": "https://www.bruzz.be/actua/politiek/datalek-bij-vooruitbrussels-hackers-vragen-800-euro-losgeld-2024-04-18",
        "added": "2024-04-19"
    },
    {
        "date": "2024-04-16",
        "victim": "Norrmjerier",
        "domain": "norrmjerier.se",
        "country": "SWE",
        "summary": "Mardi matin, une cyberattaque a été découverte contre Norrmjerier à Umeå, rapporte Norran. Les opérations ont dû être arrêtées et la gestion de crise activée.",
        "title": "Cyberattack mot mejeri - produktionen stoppas",
        "url": "https://omni.se/cyberattack-mot-mejeri-produktionen-stoppas/a/yE1Ova",
        "added": "2024-04-17"
    },
    {
        "date": "2024-04-16",
        "victim": "Hôpital Simone Veil à Cannes",
        "domain": "ch-cannes.fr",
        "country": "FRA",
        "summary": "L'hôpital Simone Veil à Cannes a subi un \"black-out\" informatique depuis le mardi 16 avril, entraînant l'annulation d'interventions et de rendez-vous, suspecté d'être dû à une cyberattaque, bien que l'hôpital mentionne officiellement un \"incident technique en cours\". Une cellule de crise a été activée en collaboration avec divers organismes régionaux pour gérer la situation. En conséquence, toutes les activités non urgentes et les consultations sont reportées jusqu'à ce que le système informatique soit rétabli.",
        "title": "\"Black out\" informatique à l’hôpital de Cannes ce mardi, \"incident technique\" ou cyberattaque? - Var-Matin",
        "url": "https://www.varmatin.com/sante/l-hopital-de-cannes-est-il-victime-d-une-cyber-attaque-915838",
        "added": "2024-04-17"
    },
    {
        "date": "2024-04-15",
        "victim": "Cenans",
        "domain": "",
        "country": "FRA",
        "summary": "La mairie a été victime d'un cryptovirus, selon l'association Déclic.",
        "title": "",
        "url": "https://www.linkedin.com/posts/asso-declic_attaques-cybersécurité-auprès-dorganismes-activity-7189253897910149120-m8_j/",
        "added": "2024-05-29"
    },
    {
        "date": "2024-04-15",
        "victim": "Katholische Jugendfürsorge der Diözese Augsburg (KJF)",
        "domain": "kjf-augsburg.de",
        "country": "DEU",
        "summary": "La Katholische Jugendfürsorge der Diözese Augsburg (KJF) a été victime d'une cyberattaque professionnelle mi-avril, au cours de laquelle des données personnelles, financières, de patients et de santé ont été volées dans plusieurs de ses établissements, y compris la plus grande maternité de la région, le Josefinum à Augsburg. Les hackers ont accédé à des parties de l'infrastructure informatique de la KJF, mais il semble que les documents de traitement ou les lettres médicales n'ont pas été dérobés. La KJF a mis en place une hotline pour les personnes potentiellement affectées et conseille de changer les mots de passe et de surveiller attentivement les comptes bancaires pour prévenir l'us",
        "title": "Cyberangriff: Hacker stehlen Daten von Patienten der KJF Augsburg",
        "url": "https://www.augsburger-allgemeine.de/bayern/cyberangriff-hacker-stehlen-daten-von-patienten-der-kjf-augsburg-id70612686.html",
        "added": "2024-05-01"
    },
    {
        "date": "2024-04-15",
        "victim": "Comté de Coffee, Géorgie",
        "domain": "coffeecountygov.com",
        "country": "USA",
        "summary": "L'infrastructure informatique du comté de Coffee en Géorgie, déjà au cœur de controverses liées aux allégations de fraude lors de l'élection présidentielle américaine de 2020, a été victime d'une cyberattaque début avril, entraînant la coupure de son accès aux systèmes électoraux de l'État par mesure de précaution. Aucune preuve d'exfiltration de données n'a été trouvée, mais l'activité malveillante a été détectée par l'Agence de Cybersécurité et de Sécurité des Infrastructures. Cette attaque survient dans un contexte où d'autres comtés géorgiens impliqués dans des batailles juridiques liées aux tentatives de remise",
        "title": "Cyberattack hits Georgia county at center of voting software breach | CyberScoop",
        "url": "https://cyberscoop.com/cyberattack-hits-georgia-county-at-center-of-voting-software-breach/",
        "added": "2024-04-27"
    },
    {
        "date": "2024-04-15",
        "victim": "Police Fédérale du Brésil",
        "domain": "gov.br",
        "country": "BRA",
        "summary": "La Police Fédérale du Brésil a suspendu le service d'agendement en ligne pour l'émission de passeports suite à une tentative de cyberattaque détectée au début de la semaine. L'interruption du service restera en vigueur jusqu'à ce que l'intégrité des systèmes soit vérifiée, bien que les rendez-vous déjà pris soient maintenus. La PF a commencé une enquête sur l'incident et conseille aux usagers sans voyage imminent de reporter leur demande de passeport.",
        "title": "PF suspende passaporte pela internet após ataque hacker - Convergência Digital - Segurança",
        "url": "https://www.convergenciadigital.com.br/Seguranca/PF-suspende-passaporte-pela-internet-apos-ataque-hacker-65781.html",
        "added": "2024-04-20"
    },
    {
        "date": "2024-04-15",
        "victim": "Octapharma Plasma",
        "domain": "octapharmaplasma.com",
        "country": "USA",
        "summary": "Octapharma Plasma, une entreprise médicale exploitant plus de 150 centres de don de plasma sanguin aux États-Unis, a fermé ses installations en raison de problèmes de réseau attribués à une infection par le ransomware BlackSuit. Cette cyberattaque pourrait affecter l'approvisionnement en plasma d'Octapharma en Europe, car plus de 75 % de leur plasma provient des États-Unis. Le FBI a été alerté de l'incident, qui s'inscrit dans une tendance croissante de ciblage des organisations de santé par des cybercriminels utilisant des tactiques d'extorsion.",
        "title": "Ransomware feared as Octapharma Plasma closes 150+ centers • The Register",
        "url": "https://www.theregister.com/2024/04/18/ransomware_octapharma_plasma/",
        "added": "2024-04-19"
    },
    {
        "date": "2024-04-15",
        "victim": "Le Slip Français",
        "domain": "leslipfrancais.fr",
        "country": "FRA",
        "summary": "Le Slip Français, une entreprise spécialisée dans la vente de sous-vêtements, a été victime d'une cyberattaque le 15 avril, entraînant le vol de certaines données personnelles de ses clients, mais sans compromettre les mots de passe ou les données de carte de paiement. L'entreprise a réagi en formant une cellule de crise avec des experts en cybersécurité pour circonscrire l'attaque et surveiller d'éventuelles fraudes. Une plainte a été déposée et un signalement a été fait à la CNIL, bien que l'ampleur de l'attaque reste à déterminer, et l'entreprise a informé ses clients, y compris ceux désinscrits, de manière préventive.",
        "title": "Des données \"volées par des hackers\": le Slip Français victime d'une cyberattaque",
        "url": "https://www.bfmtv.com/tech/actualites/cybersecurite/des-donnees-volees-par-des-hackers-le-slip-francais-victime-d-une-cyberattaque_AV-202404170397.html",
        "added": "2024-04-17"
    },
    {
        "date": "2024-04-14",
        "victim": "Le ministère de la Santé de la République Dominicaine.",
        "domain": "salud.gob.do",
        "country": "DOM",
        "summary": "Lundi dernier, le ministère de la Santé de la République Dominicaine a confirmé une attaque numérique qui a conduit au vol de 8 000 dossiers de vaccination contre la Covid-19. Ces dossiers, contenant des informations personnelles des patients, pourraient être vendus sur le DarkWeb pour une somme modique, selon des experts. L'enquête policière cherche à identifier les pirates, bien que leur usage du DarkWeb complique leur traçabilité, mettant en lumière les défis de la cybersécurité face à de telles attaques.",
        "title": "République Dominicaine. Le ministère de la Santé a subi une cyber-attaque - KARIBINFO",
        "url": "https://www.karibinfo.com/news/republique-dominicaine-le-ministere-de-la-sante-a-subi-une-cyber-attaque/",
        "added": "2024-04-19"
    },
    {
        "date": "2024-04-14",
        "victim": "Frontier Communications",
        "domain": "frontier.com",
        "country": "USA",
        "summary": "Frontier Communications, un fournisseur américain de télécommunications, a été victime d'une cyberattaque par un groupe de cybercriminels qui a entraîné l'accès non autorisé à des données personnellement identifiables (PII) et la fermeture partielle de certains systèmes pour contenir la menace. La société a depuis restauré ses systèmes informatiques principaux affectés et travaille à rétablir les opérations commerciales normales, tout en informant les autorités et en engageant des experts en cybersécurité. Malgré les assurances de Frontier, des clients ont signalé des problèmes de connexion Internet et des difficultés à contacter le support par téléphone.",
        "title": "Frontier Communications shuts down systems after cyberattack",
        "url": "https://www.bleepingcomputer.com/news/security/frontier-communications-shuts-down-systems-after-cyberattack/",
        "added": "2024-04-19"
    },
    {
        "date": "2024-04-14",
        "victim": "Plus Servicios",
        "domain": "plusservicios.cl",
        "country": "CHL",
        "summary": "Un cyberattaque par ransomware a affecté certains serveurs de l'infrastructure technologique de l'organisation Plus Servicios, provoquant une interruption partielle de leurs services en ligne le dimanche 14 avril 2024. Des mesures ont été prises pour rétablir rapidement la continuité opérationnelle et mener une enquête forensique afin d'identifier l'origine de l'attaque et d'appliquer les correctifs nécessaires. Des experts en cybersécurité sont consultés pour restaurer les services et applications le plus rapidement possible, et des mises à jour seront fournies sur l'état des services à venir. En cas de questions ou de préoccupations, l'équipe reste à disposition pour toute assistance.",
        "title": "COMUNICADO INCIDENTE TECNOLÓGICO",
        "url": "https://pbs.twimg.com/media/GLTBaq3XUAAUnOX?format=jpg&name=4096x4096",
        "added": "2024-04-17"
    },
    {
        "date": "2024-04-13",
        "victim": "Apollo Hospitals",
        "domain": "apollohospitals.com",
        "country": "IND",
        "summary": "Un échantillon du ransomware Agenda utilisé par le groupe Qilin suggère que le groupe hospitalier Apollo Hospitals a été victime d'une cyberattaque ayant notamment affecté un environnement de sauvegarde Veeam. Le site Tor de négociation, spécifique à la victime, n'est plus accessible.",
        "title": "",
        "url": "https://www.virustotal.com/gui/file/91ea14d78a9a318e396575b9f5dd8eb3c03657067cd3d0dd382c209b78d0dee2/details",
        "added": "2024-05-27"
    },
    {
        "date": "2024-04-13",
        "victim": "Direction Générale des Achats et des Contrats Publics (DGCP)",
        "domain": "dgcp.gob.do",
        "country": "DOM",
        "summary": "La Direction Générale des Achats et des Contrats Publics (DGCP) a été ciblée par une cyberattaque qui, bien que n'ayant pas affecté son système ni ses opérations, est prise très au sérieux comme un avertissement contre de potentielles intrusions futures. L'attaque n'a pas perturbé les processus de la DGCP, mais souligne les risques liés à son rôle clé dans l'annulation de licitations non conformes ou entachées d'irrégularités. Cette cyberattaque, survenue dans le contexte d'un processus électoral, suscite des inquiétudes supplémentaires et pousse l'organisation à renforcer sa sécurité.",
        "title": "Ataque cibernético",
        "url": "https://elnacional.com.do/ataque-cibernetico/",
        "added": "2024-05-02"
    },
    {
        "date": "2024-04-13",
        "victim": "Tyler Technologies",
        "domain": "tylertech.com",
        "country": "USA",
        "summary": "L'agence gouvernementale de Washington D.C., DISB, a confirmé que des données volées et divulguées par le groupe de rançongiciels LockBit provenaient d'un fournisseur de technologie tiers, Tyler Technologies, qui a subi une violation de données affectant le stockage cloud de données client du système STAR de DISB. LockBit a menacé de divulguer 1 Go de données pour inciter l'organisation à payer une rançon après l'échec des négociations. Tyler Technologies, ayant découvert une activité non autorisée dans son environnement cloud, a collaboré avec des experts tiers pour enquêter sur l'incident et a confirmé que certaines informations du système STAR avaient été publiées par LockBit.",
        "title": "DC city agency says LockBit claims tied to third-party attack",
        "url": "https://therecord.media/dc-city-agency-ransomware-attack-lockbit",
        "added": "2024-04-20"
    },
    {
        "date": "2024-04-11",
        "victim": "Iddink Learning Materials",
        "domain": "iddink.nl",
        "country": "NLD",
        "summary": "La société Iddink Learning Materials, basée à Ede et spécialisée dans la distribution de livres et de matériel pédagogique, a été victime d'une cyberattaque jeudi, avec une possible fuite ou consultation de données personnelles, incluant noms, adresses e-mail et informations bancaires de clients tels que des écoles et des élèves. L'attaque a été découverte le même jour, et une enquête est en cours pour déterminer l'étendue des dommages, tandis que les systèmes affectés ont été immédiatement isolés et les autorités compétentes alertées. Le groupe responsable de l'attaque s'identifierait sous le nom de Cactus, mais aucun contact n'a été établi avec eux.",
        "title": "Cyberaanval op boekenleverancier, mogelijk bankgegevens gestolen",
        "url": "https://www.welingelichtekringen.nl/samenleving/cyberaanval-op-boekenleverancier-mogelijk-bankgegevens-gestolen",
        "added": "2024-04-14"
    },
    {
        "date": "2024-04-11",
        "victim": "Swinomish Casino and Lodge",
        "domain": "swinomishcasinoandlodge.com",
        "country": "USA",
        "summary": "Le Swinomish Casino and Lodge a été fermé en raison d'une cyberattaque. Les détails spécifiques de l'attaque, tels que la méthode utilisée ou l'identité des attaquants, ne sont pas fournis dans votre message. Les conséquences immédiates pour le casino et les mesures prises en réponse à l'attaque ne sont pas non plus mentionnées.",
        "title": "Cyber attack closes Swinomish Casino and Lodge",
        "url": "https://www.fox13seattle.com/news/cyber-attack-swinomish-casino-lodge",
        "added": "2024-04-12"
    },
    {
        "date": "2024-04-11",
        "victim": "Taiwan United Renewable Energy Corporation (URECO)",
        "domain": "urecorp.com",
        "country": "TWN",
        "summary": "En raison d'une cyberattaque touchant certains de ses systèmes informatiques, la United Renewable Energy Corporation (URECO) de Taiwan a suspendu ses activités d'usine, évaluant encore l'impact financier. Son département informatique a activé des mesures de défense et de récupération complètes, en collaboration avec des experts en sécurité externes. ",
        "title": "台灣聯合再生能源：遭到網絡攻擊以致工廠停工",
        "url": "http://www.aastocks.com/tc/stocks/news/glh-news/GLH1482129L/1",
        "added": "2024-04-11"
    },
    {
        "date": "2024-04-10",
        "victim": "The de Ferrers Trust",
        "domain": "deferrerstrust.com",
        "country": "GBR",
        "summary": "Des élèves de deux écoles du Derbyshire ont repris les cours avec un jour de retard après les vacances de Pâques en raison d'une cyberattaque par force brute qui a contraint le trust gérant ces établissements à fermer tous les systèmes informatiques. L'attaque visait une des écoles du de Ferrers Trust, mais toutes les écoles du trust ont dû vérifier leurs systèmes et dispositifs pour les protéger. Aucune preuve n'indique que les systèmes ont été compromis, et l'attaque a été signalée aux autorités compétentes tout en poursuivant les investigations pour renforcer la sécurité.",
        "title": "Derbyshire pupils miss school after 'brute force attack' shuts down IT systems - Derbyshire Live",
        "url": "https://www.derbytelegraph.co.uk/news/local-news/derbyshire-pupils-miss-school-after-9225221",
        "added": "2024-04-17"
    },
    {
        "date": "2024-04-10",
        "victim": "Ville de Saint-Nazaire et son agglomération",
        "domain": "saintnazaire.fr",
        "country": "FRA",
        "summary": "La Ville de Saint-Nazaire et son agglomération ont été victimes d'une cyberattaque le mercredi 10 avril 2024, entraînant l'impossibilité d'utiliser leur réseau et le téléphone. Les employés des deux collectivités ont reçu l'instruction de ne pas allumer leurs ordinateurs pour éviter d'aggraver la situation. Les services informatiques sont actuellement en train d'analyser l'ampleur de l'attaque, qui semble affecter différemment les divers services.",
        "title": "La Ville de Saint-Nazaire et son agglo victimes d’une cyberattaque",
        "url": "https://www.ouest-france.fr/pays-de-la-loire/saint-nazaire-44600/la-ville-de-saint-nazaire-et-son-agglo-victimes-dune-cyberattaque-95474dfe-f712-11ee-99ce-03491e0281c3",
        "added": "2024-04-10"
    },
    {
        "date": "2024-04-09",
        "victim": "Shook Lin & Bok",
        "domain": "shooklin.com",
        "country": "SGP",
        "summary": "Le cabinet d'avocats Shook Lin & Bok, basé à Singapour, a été victime d'une cyberattaque par rançongiciel le mois dernier, le 9. Bien que l'attaque ait été signalée, il n'y a actuellement aucune preuve que les données clients dans les systèmes centraux aient été compromises. L'Autorité de cybersécurité de Singapour a assisté le cabinet et conseille de ne pas payer la rançon, car cela ne garantit pas la résolution du problème et pourrait rendre la victime plus susceptible à de futures attaques.",
        "title": "旭龄及穆律师事务所遭勒索软件攻击 - 8world",
        "url": "https://www.8world.com/singapore/ransomware-attack-2444656",
        "added": "2024-05-02"
    },
    {
        "date": "2024-04-09",
        "victim": "Speedy France",
        "domain": "speedy.fr",
        "country": "FRA",
        "summary": "Speedy France, une entreprise de réparation automobile, a annoncé avoir subi un \"incident de cybersécurité\" qui pourrait avoir compromis les données personnelles de ses clients inscrits dans ses bases de données. L'entreprise a immédiatement mobilisé des équipes d'experts et des partenaires pour prendre les mesures de protection nécessaires et mener des investigations. La Commission nationale de l'informatique et des libertés (Cnil) a été informée de l'incident, et Speedy France souligne l'importance qu'elle accorde à la sécurité et à la protection des données de ses clients et partenaires.",
        "title": "Des données personnelles \"compromises\": Speedy France victime d'une cyberattaque",
        "url": "https://www.bfmtv.com/tech/actualites/cybersecurite/des-donnees-personnelles-compromises-speedy-france-victime-d-une-cyberattaque_AV-202404190752.html",
        "added": "2024-04-20"
    },
    {
        "date": "2024-04-09",
        "victim": "Extern",
        "domain": "extern.org",
        "country": "IRL",
        "summary": "Un enquête policière a été lancée suite à une violation de données dans une attaque de ransomware contre une association qui travaille avec des enfants vulnérables. Extern, une association de justice sociale transfrontalière avec des bureaux à Belfast et dans le comté de Kildare, a confirmé être victime d'une importante cyberattaque par ransomware.",
        "title": "Authorities investigating ransomware attack on charity that works with vulnerable children",
        "url": "https://www.thejournal.ie/extern-data-breach-6356433-Apr2024/",
        "added": "2024-04-17"
    },
    {
        "date": "2024-04-09",
        "victim": "Pak Suzuki",
        "domain": "suzukipakistan.com",
        "country": "PAK",
        "summary": "L'article rapporte que Pak Suzuki a été victime d'une cyberattaque, comme annoncé par Mettis Global Link. Les détails techniques ou l'impact de l'attaque sur les opérations de l'entreprise ne sont pas précisés dans l'extrait fourni. Il est mentionné que les données sont retardées de 20 minutes, mais le contexte de cette information n'est pas clair sans informations supplémentaires.",
        "title": "Pak Suzuki hit by cyber-attack - Mettis Global Link",
        "url": "https://mettisglobal.news/pak-suzuki-hit-by-cyber-attack/",
        "added": "2024-04-15"
    }
]